zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
/**
  ******************************************************************************
  * @file    stm32wb07_06_hci_le.h
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Header file for external uC - stm32wb07_06 in network coprocessor mode (hci_le)
  *          Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#ifndef _STM32WB07_06_HCI_LE_H_
#define _STM32WB07_06_HCI_LE_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "ble_types.h"
#include "stm32wb07_06_types.h"
/** Documentation for C struct advertising_set_parameters_t */
typedef struct advertising_set_parameters_t_s
{
  /** It is used to identify an advertising set.
    *  Values:
    *  - 0x00 ... 0xEF
    */
  uint8_t advertising_handle;
  /** The duration[i] parameter indicates the duration for which that advertising set
    *  is enabled. The duration begins at the start of the first advertising
    *  event of this advertising set. The Controller should not start an extended
    *  advertising event that it cannot complete within the duration. Time = N *
    *  10 ms 0x00 means no advertising duration: advertising will continue until
    *  the Host disables it.
    *  Values:
    *  - 0x0000 (0 ms) : No advertising duration
    *  - 0x0001 (10 ms)  ... 0xFFFF (655350 ms)
    */
  uint16_t duration;
  /** The max_extended_advertising_events[i] parameter, if non-zero, indicates the
    *  maximum number of extended advertising events that shall be sent prior to
    *  disabling the extended advertising set even if the duration[i] parameter
    *  has not expired.
    *  Values:
    *  - 0x00: No maximum number of advertising events.
    *  - 0x01 ... 0xFF: Maximum number of extended advertising events.
    */
  uint8_t max_extended_advertising_events;
} advertising_set_parameters_t;
/** Documentation for C struct extended_scan_parameters_t */
typedef struct extended_scan_parameters_t_s
{
  /** The scan_type parameter specifies the type of scan to perform. 0: Passive
    *  Scanning. No scan request PDUs shall be sent. 1: Active Scanning. Scan
    *  request PDUs may be sent.
    *  Values:
    *  - 0x00: Passive Scanning
    *  - 0x01: Active Scanning
    */
  uint8_t scan_type;
  /** Time interval from when the Controller started its last scan until it begins the
    *  subsequent scan on the primary advertising channel.  Time = N * 0.625 ms
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_interval;
  /** Duration of the scan on the primary advertising channel.  Time = N * 0.625 ms
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_window;
} extended_scan_parameters_t;
/** Documentation for C struct extended_create_connection_parameters_t */
typedef struct extended_create_connection_parameters_t_s
{
  /** Time interval from when the Controller started its last scan until it begins the
    *  subsequent scan on the primary advertising channel. Time = N * 0.625 ms;
    *  Time Range: 2.5 ms to 40.959375 s.
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_interval;
  /** Duration of the scan on the primary advertising channel. Time = N * 0.625 ms;
    *  Time Range: 2.5 ms to 40.959375 s.
    *  Values:
    *  - 0x0004 (2.500 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t scan_window;
  /** Minimum value for the connection interval. This shall be less than or equal to
    *  conn_interval_max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
    *  Values:
    *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
    */
  uint16_t conn_interval_min;
  /** Maximum value for the connection interval. This shall be less than or equal to
    *  conn_interval_max[i]. Time = N * 1.25 ms; Time Range: 7.5 ms to 4 s.
    *  Values:
    *  - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
    */
  uint16_t conn_interval_max;
  /** Slave latency for the connection in number of connection events
    *  Values:
    *  - 0x0000 ... 0x01F3
    */
  uint16_t conn_latency;
  /** Supervision timeout for the LE Link. (See [Vol 6] Part B, Section 4.5.2) Time =
    *  N * 10 ms; Time Range: 100 ms to 32 s.
    *  Values:
    *  - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
    */
  uint16_t supervision_timeout;
  /** Informative parameter recommending the minimum length of connection event needed
    *  for this LE connection. Time = N * 0.625 ms.
    *  Values:
    *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t minimum_ce_length;
  /** Informative parameter recommending the maximum length of connection event needed
    *  for this LE connection. Time = N * 0.625 ms.
    *  Values:
    *  - 0x0000 (0.000 ms)  ... 0xFFFF (40959.375 ms)
    */
  uint16_t maximum_ce_length;
} extended_create_connection_parameters_t;
/**
  * @brief The @ref hci_disconnect is used to terminate an existing connection.
  *        The connection_handle command parameter indicates which connection is
  *        to be disconnected. The reason command parameter indicates the reason
  *        for ending the connection. The remote Controller will receive the
  *        reason command parameter in the @ref hci_disconnection_complete_event
  *        event. All synchronous connections on a physical link should be
  *        disconnected before the ACL connection on the same physical connection
  *        is disconnected. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.1.6) It is important to leave an 100 ms blank window before sending
  *        any new command (including system hardware reset), since immediately
  *        after @ref hci_disconnection_complete_event event, system could save
  *        important information in non volatile memory.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason for ending the connection.
  *        Values:
  *        - 0x05: Authentication Failure
  *        - 0x13: Remote User Terminated Connection
  *        - 0x14: Remote Device Terminated Connection due to Low Resources
  *        - 0x15: Remote Device Terminated Connection due to Power Off
  *        - 0x1A: Unsupported Remote Feature
  *        - 0x3B: Unacceptable Connection Parameters
  * @retval Value indicating success or error code.
  */
ble_status_t hci_disconnect(uint16_t connection_handle,
                            uint8_t reason);
/**
  * @brief This command will obtain the values for the version information for
  *        the remote device identified by the connection_handle parameter. The
  *        connection_handle must be a connection_handle for an ACL or LE
  *        connection. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.1.23)
  * @param connection_handle Specifies which connection_handle's version
  *        information to get.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_remote_version_information(uint16_t connection_handle);
/**
  * @brief The Set_Event_Mask command is used to control which events are
  *        generated by the HCI for the Host.  If the bit in the event_mask is
  *        set to a one, then the event associated with that bit will be enabled.
  *        For an LE Controller, the LE Meta Event bit in the event_mask shall
  *        enable or disable all LE events in the LE Meta Event (see Section
  *        7.7.65). The Host has to deal with each event that occurs. The event
  *        mask allows the Host to control how much it is interrupted. (See
  *        Bluetooth Specification v.4.1, Vol. 2, Part E, 7.3.1)
  * @param event_mask Event mask. Default: 0x00001FFFFFFFFFFF
  *        Flags:
  *        - 0x0000000000000000: No events specified
  *        - 0x0000000000000001: Inquiry Complete Event
  *        - 0x0000000000000002: Inquiry Result Event
  *        - 0x0000000000000004: Connection Complete Event
  *        - 0x0000000000000008: Connection Request Event
  *        - 0x0000000000000010: Disconnection Complete Event
  *        - 0x0000000000000020: Authentication Complete Event
  *        - 0x0000000000000040: Remote Name Request Complete Event
  *        - 0x0000000000000080: Encryption Change Event
  *        - 0x0000000000000100: Change Connection Link Key Complete Event
  *        - 0x0000000000000200: Master Link Key Complete Event
  *        - 0x0000000000000400: Read Remote Supported Features Complete Event
  *        - 0x0000000000000800: Read Remote Version Information Complete Event
  *        - 0x0000000000001000: QoS Setup Complete Event
  *        - 0x0000000000008000: Hardware Error Event
  *        - 0x0000000000010000: Flush Occurred Event
  *        - 0x0000000000020000: Role Change Event
  *        - 0x0000000000080000: Mode Change Event
  *        - 0x0000000000100000: Return Link Keys Event
  *        - 0x0000000000200000: PIN Code Request Event
  *        - 0x0000000000400000: Link Key Request Event
  *        - 0x0000000000800000: Link Key Notification Event
  *        - 0x0000000001000000: Loopback Command Event
  *        - 0x0000000002000000: Data Buffer Overflow Event
  *        - 0x0000000004000000: Max Slots Change Event
  *        - 0x0000000008000000: Read Clock Offset Complete Event
  *        - 0x0000000010000000: Connection Packet Type Changed Event
  *        - 0x0000000020000000: QoS Violation Event
  *        - 0x0000000040000000: Page Scan Mode Change Event
  *        - 0x0000000080000000: Page Scan Repetition Mode Change Event
  *        - 0x0000000100000000: Flow Specification Complete Event
  *        - 0x0000000200000000: Inquiry Result with RSSI Event
  *        - 0x0000000400000000: Read Remote Extended Features Complete Event
  *        - 0x0000080000000000: Synchronous Connection Complete Event
  *        - 0x0000100000000000: Synchronous Connection Changed Event
  *        - 0x0000200000000000: Sniff Subrating Event
  *        - 0x0000400000000000: Extended Inquiry Result Event
  *        - 0x0000800000000000: Encryption Key Refresh Complete Event
  *        - 0x0001000000000000: IO Capability Request Event
  *        - 0x0002000000000000: IO Capability Request Reply Event
  *        - 0x0004000000000000: User Confirmation Request Event
  *        - 0x0008000000000000: User Passkey Request Event
  *        - 0x0010000000000000: Remote OOB Data Request Event
  *        - 0x0020000000000000: Simple Pairing Complete Event
  *        - 0x0080000000000000: Link Supervision Timeout Changed Event
  *        - 0x0100000000000000: Enhanced Flush Complete Event
  *        - 0x0400000000000000: User Passkey Notification Event
  *        - 0x0800000000000000: Keypress Notification Event
  *        - 0x1000000000000000: Remote Host Supported Features Notification Event
  *        - 0x2000000000000000: LE Meta-Event
  * @retval Value indicating success or error code.
  */
ble_status_t hci_set_event_mask(uint8_t event_mask[8]);
/**
  * @brief The Reset command will reset the Link Layer on an LE Controller.  The
  *        Reset command shall not affect the used HCI transport layer since the
  *        HCI transport layers may have reset mechanisms of their own. After the
  *        reset is completed, the current operational state will be lost, the
  *        Controller will enter standby mode and the Controller will
  *        automatically revert to the default values for the parameters for
  *        which default values are defined in the specification. Note: The Reset
  *        command will not necessarily perform a hardware reset. This is
  *        implementation defined.  The Host shall not send additional HCI
  *        commands before the Command Complete event related to the Reset
  *        command has been received. (See Bluetooth Specification v.4.1, Vol. 2,
  *        Part E, 7.3.2)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_reset(void);
/**
  * @brief This command reads the values for the transmit_power_level parameter
  *        for the specified connection_handle. The connection_handle shall be a
  *        connection_handle for an ACL connection. (See Bluetooth Specification
  *        v.4.1, Vol. 2, Part E, 7.3.35)
  * @param connection_handle Specifies which connection_handle's Transmit Power
  *        Level setting to read.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param type Current or maximum transmit power level.
  *        Values:
  *        - 0x00: Read Current Transmit Power Level.
  *        - 0x01: Read Maximum Transmit Power Level.
  * @param[out] transmit_power_level Size: 1 Octet (signed integer) Units: dBm
  *             Values:
  *             - -30 ... 20
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_transmit_power_level(uint16_t connection_handle,
                                           uint8_t type,
                                           int8_t *transmit_power_level);
/**
  * @brief The HCI_Set_Event_Mask_Page_2 command is used to control which events
  *        are generated by the HCI for the Host. The event_mask_page_2 is a
  *        logical extension to the event_mask parameter of the
  *        HCI_Set_Event_Mask command. If the bit in the event_mask_page_2 is set
  *        to a one, then the event associated with that bit shall be enabled.
  *        The event mask allows the Host to control how much it is interrupted.
  *        The Controller shall ignore those bits which are reserved for future
  *        use or represent events which it does not support. If the Host sets
  *        any of these bits to 1, the Controller shall act as if they were set
  *        to 0.
  * @param event_mask_page_2 For the complete list of bits that can be set, see
  *        Core v5.1, Vol 2, part E, chapter 7.3.69. The only bit that is not
  *        ignored is: Bit 23: Authenticated Payload Timeout Expired event.
  *        Flags:
  *        - 0x0000000000800000: AUTHENTICATED_PAYLOAD_TIMEOUT_EXPIRED_EVENT
  * @retval Value indicating success or error code.
  */
ble_status_t hci_set_event_mask_page_2(uint8_t event_mask_page_2[8]);
/**
  * @brief This command reads the authenticated_payload_timeout parameter in the
  *        Primary Controller on the specified connection_handle.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] authenticated_payload_timeout Maximum amount of time specified
  *             between packets authenticated by a MIC. Time = N * 10 ms.
  *             Values:
  *             - 0x0001 (10 ms)  ... 0xFFFF (655350 ms)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_authenticated_payload_timeout(uint16_t connection_handle,
                                                    uint16_t *authenticated_payload_timeout);
/**
  * @brief This command writes the authenticated_payload_timeout parameter in the
  *        Primary Controller for the specified connection_handle. The
  *        authenticated_payload_timeout shall be equal to or greater than
  *        connInterval * (1 + connSlaveLatency). The Link Layer will use this
  *        parameter to determine when to use the LE ping sequence.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param authenticated_payload_timeout Maximum amount of time specified between
  *        packets authenticated by a valid MIC. Time = N * 10 ms.
  *        Values:
  *        - 0x0001 (10 ms)  ... 0xFFFF (655350 ms)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_write_authenticated_payload_timeout(uint16_t connection_handle,
                                                     uint16_t authenticated_payload_timeout);
/**
  * @brief This command reads the values for the version information for the
  *        local Controller. The HCI Version information defines the version
  *        information of the HCI layer. The LMP/PAL Version information defines
  *        the version of the LMP or PAL. The manufacturer_name information
  *        indicates the manufacturer of the local device. The HCI Revision and
  *        LMP/PAL Subversion are implementation dependent. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.4.1)
  * @param[out] hci_version See Bluetooth Assigned Numbers
  *             (https://www.bluetooth.org/en-us/specification/assigned-numbers)
  * @param[out] hci_revision Revision of the Current HCI in the BR/EDR
  *             Controller.
  * @param[out] lmp_pal_version Version of the Current LMP or PAL in the
  *             Controller. See Bluetooth Assigned Numbers
  *             (https://www.bluetooth.org/en-us/specification/assigned-numbers)
  * @param[out] manufacturer_name Manufacturer Name of the BR/EDR Controller. See
  *             Bluetooth Assigned Numbers (https://www.bluetooth.org/en-
  *             us/specification/assigned-numbers)
  * @param[out] lmp_pal_subversion Subversion of the Current LMP or PAL in the
  *             Controller. This value is implementation dependent.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_local_version_information(uint8_t *hci_version,
                                                uint16_t *hci_revision,
                                                uint8_t *lmp_pal_version,
                                                uint16_t *manufacturer_name,
                                                uint16_t *lmp_pal_subversion);
/**
  * @brief This command reads the list of HCI commands supported for the local
  *        Controller. This command shall return the supported_commands
  *        configuration parameter. It is implied that if a command is listed as
  *        supported, the feature underlying that command is also supported. (See
  *        Bluetooth Specification v.4.1, Vol. 2, Part E, 7.4.2)
  * @param[out] supported_commands Bit mask for each HCI Command. If a bit is 1,
  *             the Controller supports the corresponding command and the
  *             features required for the command. Unsupported or undefined
  *             commands shall be set to 0.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_local_supported_commands(uint8_t supported_commands[64]);
/**
  * @brief This command requests a list of the supported features for the local
  *        Controller. This command will return a list of the LMP features. For
  *        details see Part C, Link Manager Protocol Specification on page 227.
  *        (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.4.3)
  * @param[out] lmp_features Bit Mask List of LMP features.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_local_supported_features(uint8_t lmp_features[8]);
/**
  * @brief On an LE Controller, this command shall read the Public Device Address
  *        as defined in [Vol 6] Part B, Section 1.3, Device Address. If this
  *        Controller does not have a Public Device Address, the value
  *        0x000000000000 shall be returned. On an LE Controller, the public
  *        address shall be the same as the BD_ADDR. (See Bluetooth Specification
  *        v.4.1, Vol. 2, Part E, 7.4.6)
  * @param[out] bd_addr BD_ADDR ( Bluetooth Device Address) of the Device.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_bd_addr(uint8_t bd_addr[6]);
/**
  * @brief This command reads the Received Signal Strength Indication (RSSI)
  *        value from a Controller. For an LE transport, a connection_handle is
  *        used as the Handle command parameter and return parameter. The meaning
  *        of the RSSI metric is an absolute receiver signal strength value in
  *        dBm to +/- 6 dB accuracy. If the RSSI cannot be read, the RSSI metric
  *        shall be set to 127. (See Bluetooth Specification v.4.1, Vol. 2, Part
  *        E, 7.5.4)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] rssi N Size: 1 Octet (signed integer) Units: dBm
  *             Values:
  *             - -127 ... 20
  *             - 127: RSSI not available
  * @retval Value indicating success or error code.
  */
ble_status_t hci_read_rssi(uint16_t connection_handle,
                           int8_t *rssi);
/**
  * @brief The LE_Set_Event_Mask command is used to control which LE events are
  *        generated by the HCI for the Host. If the bit in the le_event_mask is
  *        set to a one, then the event associated with that bit will be enabled.
  *        The Host has to deal with each event that is generated by an LE
  *        Controller. The event mask allows the Host to control which events
  *        will interrupt it. For LE events to be generated, the LE Meta-Event
  *        bit in the event_mask shall also be set. If that bit is not set, then
  *        LE events shall not be generated, regardless of how the le_event_mask
  *        is set. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.1)
  * @param le_event_mask LE event mask. Default: 0x000000000000001F.
  *        Flags:
  *        - 0x0000000000000000: No LE events specified
  *        - 0x0000000000000001: LE Connection Complete Event
  *        - 0x0000000000000002: LE Advertising Report Event
  *        - 0x0000000000000004: LE Connection Update Complete Event
  *        - 0x0000000000000008: LE Read Remote Used Features Complete Event
  *        - 0x0000000000000010: LE Long Term Key Request Event
  *        - 0x0000000000000020: LE Remote Connection Parameter Request Event
  *        - 0x0000000000000040: LE Data Length Change Event
  *        - 0x0000000000000080: LE Read Local P-256 Public Key Complete Event
  *        - 0x0000000000000100: LE Generate DHKey Complete Event
  *        - 0x0000000000000200: LE Enhanced Connection Complete Event
  *        - 0x0000000000000400: LE Directed Advertising Report Event
  *        - 0x0000000000000800: LE PHY Update Complete event
  *        - 0x0000000000001000: LE Extended Advertising Report event
  *        - 0x0000000000002000: LE Periodic Advertising Sync Established event
  *        - 0x0000000000004000: LE Periodic Advertising Report event
  *        - 0x0000000000008000: LE Periodic Advertising Sync Lost event
  *        - 0x0000000000010000: LE Scan Timeout event
  *        - 0x0000000000020000: LE Advertising Set Terminated event
  *        - 0x0000000000040000: LE Scan Request Received event
  *        - 0x0000000000080000: LE Channel Selection Algorithm event
  *        - 0x0000000000100000: LE Connectionless IQ Report event
  *        - 0x0000000000200000: LE Connection IQ Report event
  *        - 0x0000000000400000: LE CTE Request Failed event
  *        - 0x0000000000800000: LE Periodic Advertising Sync Transfer Received event
  *        - 0x0000000001000000: LE CIS Established event
  *        - 0x0000000002000000: LE CIS Request event
  *        - 0x0000000004000000: LE Create BIG Complete event
  *        - 0x0000000008000000: LE Terminate BIG Complete event
  *        - 0x0000000010000000: LE BIG Sync Established event
  *        - 0x0000000020000000: LE BIG Sync Lost event
  *        - 0x0000000040000000: LE Request Peer SCA Complete event
