zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        - 0x0000000080000000: LE Path Loss Threshold event
  *        - 0x0000000100000000: LE Transmit Power Reporting event
  *        - 0x0000000200000000: LE BIGInfo Advertising Report event
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_event_mask(uint8_t le_event_mask[8]);
/**
  * @brief The LE_Read_Buffer_Size command is used to read the maximum size of
  *        the data portion of HCI LE ACL Data Packets sent from the Host to the
  *        Controller. The Host will segment the data transmitted to the
  *        Controller according to these values, so that the HCI Data Packets
  *        will contain data with up to this size. The LE_Read_Buffer_Size
  *        command also returns the total number of HCI LE ACL Data Packets that
  *        can be stored in the data buffers of the Controller. The
  *        LE_Read_Buffer_Size command must be issued by the Host before it sends
  *        any data to an LE Controller (see Section 4.1.1). If the Controller
  *        returns a length value of zero, the Host shall use the
  *        Read_Buffer_Size command to determine the size of the data buffers
  *        Note: Both the Read_Buffer_Size and LE_Read_Buffer_Size commands may
  *        return buffer length and number of packets parameter values that are
  *        nonzero. The hc_le_acl_data_packet_length return parameter shall be
  *        used to determine the size of the L2CAP PDU segments contained in ACL
  *        Data Packets, which are transferred from the Host to the Controller to
  *        be broken up into packets by the Link Layer. Both the Host and the
  *        Controller shall support command and event packets, where the data
  *        portion (excluding header) contained in the packets is 255 octets in
  *        size. The hc_total_num_le_acl_data_lackets return parameter contains
  *        the total number of HCI ACL Data Packets that can be stored in the
  *        data buffers of the Controller. The Host determines how the buffers
  *        are to be divided between different Connection Handles. Note: The
  *        hc_le_acl_data_packet_length return parameter does not include the
  *        length of the HCI Data Packet header. (See Bluetooth Specification
  *        v.4.1, Vol. 2, Part E, 7.8.2)
  * @param[out] hc_le_acl_data_packet_length 0x0000: No dedicated LE Buffer
  *             exists. Use the HCI_Read_Buffer_Size command. 0x001B - 0xFFFF
  *             Maximum length (in octets) of the data portion of each HCI ACL
  *             data packet.
  *             Values:
  *             - 0x0000: NO_BUFFER
  *             - 0x001B ... 0xFFFF
  * @param[out] hc_total_num_le_acl_data_lackets 0x00: No dedicated LE Buffer
  *             exists. Use the HCI_Read_Buffer_Size command. 0x01 - 0xFF: Total
  *             number of HCI ACL Data Packets that can be stored in the data
  *             buffers of the Controller.
  *             Values:
  *             - 0x00: NO_BUFFER
  *             - 0x01 ... 0xFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_buffer_size(uint16_t *hc_le_acl_data_packet_length,
                                     uint8_t *hc_total_num_le_acl_data_lackets);
/**
  * @brief This command requests the list of the supported LE features for the
  *        Controller. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.3)
  * @param[out] le_features Bit Mask List of LE features. See Core v4.1, Vol. 6,
  *             Part B, Section 4.6.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_local_supported_features(uint8_t le_features[8]);
/**
  * @brief The LE_Set_Random_Address command is used by the Host to set the LE
  *        Random Device Address in the Controller (see [Vol 6] Part B, Section
  *        1.3). (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.4)
  * @param random_address Random Device Address.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_random_address(uint8_t random_address[6]);
/**
  * @brief The LE_Set_Advertising_Parameters command is used by the Host to set
  *        the advertising parameters. The advertising_interval_min shall be less
  *        than or equal to the advertising_interval_max. The
  *        advertising_interval_min and advertising_interval_max should not be
  *        the same value to enable the Controller to determine the best
  *        advertising interval given other activities. For high duty cycle
  *        directed advertising, i.e. when advertising_type is 0x01
  *        (ADV_DIRECT_IND, high duty cycle), the advertising_interval_min and
  *        advertising_interval_max parameters are not used and shall be ignored.
  *        The advertising_type is used to determine the packet type that is used
  *        for advertising when advertising is enabled. own_address_type
  *        parameter indicates the type of address being used in the advertising
  *        packets. If own_address_type equals 0x02 or 0x03, the peer_address
  *        parameter contains the peer's Identity Address and the
  *        peer_address_type parameter contains the Peer's Identity Type (i.e.
  *        0x00 or 0x01). These parameters are used to locate the corresponding
  *        local IRK in the resolving list; this IRK is used to generate the own
  *        address used in the advertisement. If directed advertising is
  *        performed, i.e. when advertising_type is set to 0x01 (ADV_DIRECT_IND,
  *        high duty cycle) or 0x04 (ADV_DIRECT_IND, low duty cycle mode), then
  *        the peer_address_type and peer_address shall be valid. If
  *        own_address_type equals 0x02 or 0x03, the Controller generates the
  *        peer's Resolvable Private Address using the peer's IRK corresponding
  *        to the peer's Identity Address contained in the peer_address parameter
  *        and peer's Identity Address Type (i.e. 0x00 or 0x01) contained in the
  *        peer_address_type parameter. The advertising_channel_map is a bit
  *        field that indicates the advertising channels that shall be used when
  *        transmitting advertising packets. At least one channel bit shall be
  *        set in the advertising_channel_map parameter. The
  *        advertising_filter_policy parameter shall be ignored when directed
  *        advertising is enabled. The Host shall not issue this command when
  *        advertising is enabled in the Controller; if it is the Command
  *        Disallowed error code shall be used. If the advertising interval range
  *        provided by the Host (advertising_interval_min,
  *        advertising_interval_max) is outside the advertising interval range
  *        supported by the Controller, then the Controller shall return the
  *        Unsupported Feature or Parameter Value (0x11) error code.
  * @param advertising_interval_min Minimum advertising interval for undirected
  *        and low duty cycle directed advertising. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0020 (20.000 ms)  ... 0x4000 (10240.000 ms)
  * @param advertising_interval_max Maximum advertising interval. Time = N *
  *        0.625 msec.
  *        Values:
  *        - 0x0020 (20.000 ms)  ... 0x4000 (10240.000 ms)
  * @param advertising_type Advertising type.
  *        Values:
  *        - 0x00: ADV_IND (Connectable undirected advertising)
  *        - 0x01: ADV_DIRECT_IND, high duty cycle (Connectable high duty cycle directed advertising)
  *        - 0x02: ADV_SCAN_IND (Scannable undirected advertising)
  *        - 0x03: ADV_NONCONN_IND (Non connectable undirected advertising)
  *        - 0x04: ADV_DIRECT_IND, low duty cycle (Connectable low duty cycle directed advertising)
  * @param own_address_type Own address type.  - 0x00: Public Device Address  -
  *        0x01 Random Device Address  - 0x02: Controller generates Resolvable
  *        Private Address based on the local          IRK from resolving list.
  *        If resolving list contains no matching entry,          use public
  *        address.  - 0x03: Controller generates Resolvable Private Address
  *        based on the local          IRK from resolving list. If resolving list
  *        contains no matching entry,          use random address from
  *        LE_Set_Random_Address.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Resolvable Private Address or Public Address
  *        - 0x03: Resolvable Private Address or Random Address
  * @param peer_address_type Peer Address type.
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the device to
  *        be connected.
  * @param advertising_channel_map Advertising channel map. Default: 00000111b
  *        (all channels enabled).
  *        Flags:
  *        - 0x01: ch 37
  *        - 0x02: ch 38
  *        - 0x04: ch 39
  * @param advertising_filter_policy Advertising Filter Policy. This parameter is
  *        ignored when directed advertising is enabled.  0x00 Process scan and
  *        connection requests from all devices (i.e., the White List is not in
  *        use) 0x01 Process connection requests from all devices and scan
  *        requests only from devices that are in the White List 0x02 Process
  *        scan requests from all devices and connection requests only from
  *        devices that are in the White List. 0x03 Process scan and connection
  *        requests only from devices in the White List. All other values
  *        Reserved for future use
  *        Values:
  *        - 0x00: ADV_NO_WHITE_LIST_USE
  *        - 0x01: ADV_WHITE_LIST_FOR_ONLY_SCAN
  *        - 0x02: ADV_WHITE_LIST_FOR_ONLY_CONN
  *        - 0x03: ADV_WHITE_LIST_FOR_ALL
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_advertising_parameters(uint16_t advertising_interval_min,
                                               uint16_t advertising_interval_max,
                                               uint8_t advertising_type,
                                               uint8_t own_address_type,
                                               uint8_t peer_address_type,
                                               uint8_t peer_address[6],
                                               uint8_t advertising_channel_map,
                                               uint8_t advertising_filter_policy);
/**
  * @brief The LE_Read_Advertising_Channel_Tx_Power command is used by the Host
  *        to read the transmit power level used for LE advertising channel
  *        packets. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.6)
  * @param[out] transmit_power_level Size: 1 Octet (signed integer) Units: dBm
  *             Accuracy: +/- 4 dBm
  *             Values:
  *             - -20 ... 10
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_advertising_channel_tx_power(int8_t *transmit_power_level);
/**
  * @brief The LE_Set_Advertising_Data command is used to set the data used in
  *        advertising packets that have a data field. Only the significant part
  *        of the advertising_data is transmitted in the advertising packets, as
  *        defined in [Vol 3] Part C, Section 11., (See Bluetooth Specification
  *        v.4.1, Vol. 2, Part E, 7.8.7)
  * @param advertising_data_length The number of significant octets in the
  *        following data field
  *        Values:
  *        - 0 ... 31
  * @param advertising_data 31 octets of data formatted as defined in [Vol 3]
  *        Part C, Section 11.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_advertising_data(uint8_t advertising_data_length,
                                         uint8_t advertising_data[31]);
/**
  * @brief This command is used to provide data used in Scanning Packets that
  *        have a data field. Only the significant part of the scan_response_data
  *        is transmitted in the Scanning Packets, as defined in [Vol 3] Part C,
  *        Section 11. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.8)
  * @param scan_response_data_length The number of significant octets in the
  *        following data field
  *        Values:
  *        - 0 ... 31
  * @param scan_response_data 31 octets of data formatted as defined in [Vol 3]
  *        Part C, Section 11.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_scan_response_data(uint8_t scan_response_data_length,
                                           uint8_t scan_response_data[31]);
/**
  * @brief The LE_Set_Advertise_Enable command is used to request the Controller
  *        to start or stop advertising. The Controller manages the timing of
  *        advertisements as per the advertising parameters given in the
  *        LE_Set_Advertising_Parameters command. The Controller shall continue
  *        advertising until the Host issues an LE_Set_Advertise_Enable command
  *        with advertising_enable set to 0x00 (Advertising is disabled) or until
  *        a connection is created or until the Advertising is timed out due to
  *        high duty cycle Directed Advertising. In these cases, advertising is
  *        then disabled. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.8.9)
  * @param advertising_enable Enable/disable advertise. Default is 0 (disabled).
  *        Values:
  *        - 0x00: Disable
  *        - 0x01: Enable
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_advertising_enable(uint8_t advertising_enable);
/**
  * @brief The LE_Set_Scan_Parameters command is used to set the scan parameters.
  *        The le_scan_type parameter controls the type of scan to perform. The
  *        le_scan_interval and le_scan_window parameters are recommendations
  *        from the Host on how long (le_scan_window) and how frequently
  *        (le_scan_interval) the Controller should scan (See [Vol 6] Part B,
  *        Section 4.5.3). The le_scan_window parameter shall always be set to a
  *        value smaller or equal to the value set for the le_scan_interval
  *        parameter. If they are set to the same value scanning should be run
  *        continuously. The own_address_type parameter determines the address
  *        used (Public or Random Device Address) when performing active scan.
  *        The Host shall not issue this command when scanning is enabled in the
  *        Controller; if it is the Command Disallowed error code shall be used.
  *        (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.10)
  * @param le_scan_type Passive or active scanning. With active scanning SCAN_REQ
  *        packets are sent.
  *        Values:
  *        - 0x00: Passive Scanning
  *        - 0x01: Active scanning
  * @param le_scan_interval This is defined as the time interval from when the
  *        Controller started its last LE scan until it begins the subsequent LE
  *        scan. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms)
  * @param le_scan_window The duration of the LE scan. le_scan_window shall be
  *        less than or equal to le_scan_interval. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms)
  * @param own_address_type Own address type.  - 0x00: Public Device Address  -
  *        0x01 Random Device Address  - 0x02: Controller generates Resolvable
  *        Private Address based on the local          IRK from resolving list.
  *        If resolving list contains no matching entry,          use public
  *        address.  - 0x03: Controller generates Resolvable Private Address
  *        based on the local          IRK from resolving list. If resolving list
  *        contains no matching entry,          use random address from
  *        LE_Set_Random_Address.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Resolvable Private Address or Public Address
  *        - 0x03: Resolvable Private Address or Random Address
  * @param scanning_filter_policy 0x00 Accept all advertisement packets. Directed
  *        advertising packets which are not addressed for this device shall be
  *        ignored. 0x01 Ignore advertisement packets from devices not in the
  *        White List Only. Directed advertising packets which are not addressed
  *        for this device shall be ignored 0x02 Accept all undirected
  *        advertisement packets. Directed advertisement packets where initiator
  *        address is a RPA and  Directed advertisement packets addressed to this
  *        device shall be accepted. 0x03 Accept all undirected advertisement
  *        packets from devices that are in the White List.Directed advertisement
  *        packets where initiator address is RPA and Directed advertisement
  *        packets addressed to this device shall be accepted.
  *        Values:
  *        - 0x00: Accept all
  *        - 0x01: Ignore devices not in the White List
  *        - 0x02: Accept all (use resolving list)
  *        - 0x03: Ignore devices not in the White List (use resolving list)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_scan_parameters(uint8_t le_scan_type,
                                        uint16_t le_scan_interval,
                                        uint16_t le_scan_window,
                                        uint8_t own_address_type,
                                        uint8_t scanning_filter_policy);
/**
  * @brief The LE_Set_Scan_Enable command is used to start scanning. Scanning is
  *        used to discover advertising devices nearby. The filter_duplicates
  *        parameter controls whether the Link Layer shall filter duplicate
  *        advertising reports to the Host, or if the Link Layer should generate
  *        advertising reports for each packet received. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.8.11)
  * @param le_scan_enable Enable/disable scan. Default is 0 (disabled).
  *        Values:
  *        - 0x00: Scanning disabled
  *        - 0x01: Scanning enabled
  * @param filter_duplicates Enable/disable duplicate filtering.
  *        Values:
  *        - 0x00: Duplicate filtering disabled
  *        - 0x01: Duplicate filtering enabled
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_scan_enable(uint8_t le_scan_enable,
                                    uint8_t filter_duplicates);
/**
  * @brief The LE_Create_Connection command is used to create a Link Layer
  *        connection to a connectable advertiser. The le_scan_interval and
  *        le_scan_window parameters are recommendations from the Host on how
  *        long (le_scan_window) and how frequently (le_scan_interval) the
  *        Controller should scan. The le_scan_window parameter shall be set to a
  *        value smaller or equal to the value set for the le_scan_interval
  *        parameter. If both are set to the same value, scanning should run
  *        continuously. The initiator_filter_policy is used to determine whether
  *        the White List is used. If the White List is not used, the
  *        peer_address_type and the peer_address parameters specify the address
  *        type and address of the advertising device to connect to. The Link
  *        Layer shall set the address in the CONNECT_REQ packets to either the
  *        Public Device Address or the Random Device Addressed based on the
  *        own_address_type parameter. The conn_interval_min and
  *        conn_interval_max parameters define the minimum and maximum allowed
  *        connection interval. The conn_interval_min parameter shall not be
  *        greater than the conn_interval_max parameter. The conn_latency
  *        parameter defines the maximum allowed connection latency (see [Vol 6]
  *        Part B, Section 4.5.1). The supervision_timeout parameter defines the
  *        link supervision timeout for the connection. The supervision_timeout
  *        in milliseconds shall be larger than (1 + conn_latency) *
  *        conn_interval_max * 2, where conn_interval_max is given in
  *        milliseconds. (See [Vol 6] Part B, Section 4.5.2). The
  *        minimum_ce_length and maximum_ce_length parameters are informative
  *        parameters providing the Controller with the expected minimum and
  *        maximum length of the connection events. The minimum_ce_length
  *        parameter shall be less than or equal to the maximum_ce_length
  *        parameter. The Host shall not issue this command when another
  *        LE_Create_Connection is pending in the Controller; if this does occur
  *        the Controller shall return the Command Disallowed error code shall be
  *        used. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.12)
  * @param le_scan_interval This is defined as the time interval from when the
  *        Controller started its last LE scan until it begins the subsequent LE
  *        scan. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms)
  * @param le_scan_window The duration of the LE scan. le_scan_window shall be
  *        less than or equal to le_scan_interval. Time = N * 0.625 msec.
  *        Values:
  *        - 0x0004 (2.500 ms)  ... 0x4000 (10240.000 ms)
  * @param initiator_filter_policy 0x00 White list is not used to determine which
  *        advertiser to connect to. peer_address_type and peer_address shall be
  *        used. 0x01 White list is used to determine which advertiser to connect
  *        to. peer_address_type and peer_address shall be ignored.
  *        Values:
  *        - 0x00: White list not used
  *        - 0x01: White list used
  * @param peer_address_type 0x00 Public Device Address 0x01 Random Device
  *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
  *        Address) 0x03 Random (Static) Identity Address (Corresponds to
  *        Resolved Private Address)
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address
  *        - 0x03: Random (Static) Identity Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the
  *        advertising device.
  * @param own_address_type Own address type.  - 0x00: Public Device Address  -
  *        0x01 Random Device Address  - 0x02: Controller generates Resolvable
  *        Private Address based on the local          IRK from resolving list.
  *        If resolving list contains no matching entry,          use public
  *        address.  - 0x03: Controller generates Resolvable Private Address
  *        based on the local          IRK from resolving list. If resolving list
  *        contains no matching entry,          use random address from
  *        LE_Set_Random_Address.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Resolvable Private Address or Public Address
  *        - 0x03: Resolvable Private Address or Random Address
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
