zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_create_connection(uint16_t le_scan_interval,
                                      uint16_t le_scan_window,
                                      uint8_t initiator_filter_policy,
                                      uint8_t peer_address_type,
                                      uint8_t peer_address[6],
                                      uint8_t own_address_type,
                                      uint16_t conn_interval_min,
                                      uint16_t conn_interval_max,
                                      uint16_t conn_latency,
                                      uint16_t supervision_timeout,
                                      uint16_t minimum_ce_length,
                                      uint16_t maximum_ce_length);
/**
  * @brief The LE_Create_Connection_Cancel command is used to cancel the
  *        LE_Create_Connection command. This command shall only be issued after
  *        the LE_Create_Connection command has been issued, a Command Status
  *        event has been received for the LE Create Connection command and
  *        before the LE Connection Complete event. (See Bluetooth Specification
  *        v.4.1, Vol. 2, Part E, 7.8.13)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_create_connection_cancel(void);
/**
  * @brief The LE_Read_White_List_Size command is used to read the total number
  *        of white list entries that can be stored in the Controller. (See
  *        Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.14)
  * @param[out] white_list_size Total number of white list entries that can be
  *             stored in the Controller.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_white_list_size(uint8_t *white_list_size);
/**
  * @brief The LE_Clear_White_List command is used to clear the white list stored
  *        in the Controller. This command can be used at any time except when: -
  *        the advertising filter policy uses the white list and advertising is
  *        enabled. - the scanning filter policy uses the white list and scanning
  *        is enabled. - the initiator filter policy uses the white list and an
  *        LE_Create_Connection command is outstanding. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.8.15)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_clear_white_list(void);
/**
  * @brief The LE_Add_Device_To_White_List command is used to add a single device
  *        to the white list stored in the Controller. This command can be used
  *        at any time except when: - the advertising filter policy uses the
  *        white list and advertising is enabled. - the scanning filter policy
  *        uses the white list and scanning is enabled. - the initiator filter
  *        policy uses the white list and a create connection command is
  *        outstanding. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.8.16)
  * @param address_type Address type.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param address Public Device Address or Random Device Address of the device
  *        to be added to the list.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_add_device_to_white_list(uint8_t address_type,
                                             uint8_t address[6]);
/**
  * @brief The LE_Remove_Device_From_White_List command is used to remove a
  *        single device from the white list stored in the Controller. This
  *        command can be used at any time except when: - the advertising filter
  *        policy uses the white list and advertising is enabled. - the scanning
  *        filter policy uses the white list and scanning is enabled. - the
  *        initiator filter policy uses the white list and a create connection
  *        command is outstanding. (See Bluetooth Specification v.4.1, Vol. 2,
  *        Part E, 7.8.17)
  * @param address_type Address type.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param address Public Device Address or Random Device Address of the device
  *        to be removed from the white list.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_remove_device_from_white_list(uint8_t address_type,
                                                  uint8_t address[6]);
/**
  * @brief The LE_Connection_Update command is used to change the Link Layer
  *        connection parameters of a connection. This command is supported only
  *        on master side. The conn_interval_min and conn_interval_max parameters
  *        are used to define the minimum and maximum allowed connection
  *        interval. The conn_interval_min parameter shall not be greater than
  *        the conn_interval_max parameter. The conn_latency parameter shall
  *        define the maximum allowed connection latency. The supervision_timeout
  *        parameter shall define the link supervision timeout for the LE link.
  *        The supervision_timeout in milliseconds shall be larger than (1 +
  *        conn_latency) * conn_interval_max * 2, where conn_interval_max is
  *        given in milliseconds. The minimum_ce_length and maximum_ce_length are
  *        information parameters providing the Controller with a hint about the
  *        expected minimum and maximum length of the connection events. The
  *        minimum_ce_length shall be less than or equal to the
  *        maximum_ce_length. The actual parameter values selected by the Link
  *        Layer may be different from the parameter values provided by the Host
  *        through this command. (See Bluetooth Specification v.4.1, Vol. 2, Part
  *        E, 7.8.18)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval_min Minimum value for the connection event interval.
  *        This shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_interval_max Maximum value for the connection event interval.
  *        This shall be greater than or equal to conn_interval_min. Time = N *
  *        1.25 msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param minimum_ce_length Information parameter about the minimum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @param maximum_ce_length Information parameter about the maximum length of
  *        connection needed for this LE connection. Time = N * 0.625 msec.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_connection_update(uint16_t connection_handle,
                                      uint16_t conn_interval_min,
                                      uint16_t conn_interval_max,
                                      uint16_t conn_latency,
                                      uint16_t supervision_timeout,
                                      uint16_t minimum_ce_length,
                                      uint16_t maximum_ce_length);
/**
  * @brief The HCI_LE_Set_Host_Channel_Classification command allows the Host to
  *        specify a channel classification for the data, secondary advertising,
  *        periodic, and isochronous physical channels based on its local
  *        information. This classification persists until overwritten with a
  *        subsequent HCI_LE_Set_Host_Channel_Classification command or until the
  *        Controller is reset using the HCI_Reset command. If this command is
  *        used, the Host should send it within 10 seconds of knowing that the
  *        channel classification has changed. The interval between two
  *        successive commands sent shall be at least one second.
  * @param le_channel_map This parameter contains 37 1-bit fields. The nth such
  *        field (in the range 0 to 36) contains the value for the link layer
  *        channel index n. Channel n is bad = 0. Channel n is unknown = 1. The
  *        most significant bits are reserved and shall be set to 0. At least one
  *        channel shall be marked as unknown.
  *        Flags:
  *        - 0x0000000000 ... 0x1FFFFFFFFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_host_channel_classification(uint8_t le_channel_map[5]);
/**
  * @brief The LE_Read_Channel_Map command returns the current Channel_Map for
  *        the specified connection_handle. The returned value indicates the
  *        state of the Channel_Map specified by the last transmitted or received
  *        Channel_Map (in a CONNECT_REQ or LL_CHANNEL_MAP_REQ message) for the
  *        specified connection_handle, regardless of whether the Master has
  *        received an acknowledgement. (See Bluetooth Specification v.4.1, Vol.
  *        2, Part E, 7.8.20)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] le_channel_map This parameter contains 37 1-bit fields. The nth
  *             such field (in the range 0 to 36) contains the value for the link
  *             layer channel index n. Channel n is unused = 0. Channel n is used
  *             = 1. The most significant bits are reserved and shall be set to
  *             0.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_channel_map(uint16_t connection_handle,
                                     uint8_t le_channel_map[5]);
/**
  * @brief This command requests a list of the used LE features from the remote
  *        device. This command shall return a list of the used LE features. For
  *        details see [Vol 6] Part B, Section 4.6. This command may be issued on
  *        both the master and slave. (See Bluetooth Specification v.4.1, Vol. 2,
  *        Part E, 7.8.21)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_remote_used_features(uint16_t connection_handle);
/**
  * @brief The LE_Encrypt command is used to request the Controller to encrypt
  *        the plaintext_data in the command using the Key given in the command
  *        and returns the encrypted_data to the Host. The AES-128 bit block
  *        cypher is defined in NIST Publication FIPS-197
  *        (http://csrc.nist.gov/publications/fips/ fips197/fips-197.pdf). (See
  *        Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.22)
  * @param Key 128 bit key for the encryption of the data given in the command.
  * @param plaintext_data 128 bit data block that is requested to be encrypted.
  * @param[out] encrypted_data 128 bit encrypted data block.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_encrypt(uint8_t key[16],
                            uint8_t plaintext_data[16],
                            uint8_t encrypted_data[16]);
/**
  * @brief The LE_Rand command is used to request the Controller to generate 8
  *        octets of random data to be sent to the Host. The random_number shall
  *        be generated according to [Vol 2] Part H, Section 2 if the LE Feature
  *        (LL Encryption) is supported. (See Bluetooth Specification v.4.1, Vol.
  *        2, Part E, 7.8.23)
  * @param[out] random_number Random Number
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_rand(uint8_t random_number[8]);
/**
  * @brief The LE_Start_Encryption command is used to authenticate the given
  *        encryption key associated with the remote device specified by the
  *        connection handle, and once authenticated will encrypt the connection.
  *        The parameters are as defined in [Vol 3] Part H, Section 2.4.4. If the
  *        connection is already encrypted then the Controller shall pause
  *        connection encryption before attempting to authenticate the given
  *        encryption key, and then re-encrypt the connection. While encryption
  *        is paused no user data shall be transmitted. On an authentication
  *        failure, the connection shall be automatically disconnected by the
  *        Link Layer. If this command succeeds, then the connection shall be
  *        encrypted. This command shall only be used when the local device's
  *        role is Master. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.8.24)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param random_number 64 bit random number.
  * @param encrypted_diversifier 16 bit encrypted diversifier.
  * @param long_term_key 128 bit long term key.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_start_encryption(uint16_t connection_handle,
                                     uint8_t random_number[8],
                                     uint16_t encrypted_diversifier,
                                     uint8_t long_term_key[16]);
/**
  * @brief The LE_Long_Term_Key_Request_Reply command is used to reply to an LE
  *        Long Term Key Request event from the Controller, and specifies the
  *        long_term_key parameter that shall be used for this connection_handle.
  *        The long_term_key is used as defined in [Vol 6] Part B, Section 5.1.3.
  *        (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.25)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param long_term_key 128 bit long term key.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_long_term_key_request_reply(uint16_t connection_handle,
                                                uint8_t long_term_key[16]);
/**
  * @brief The LE_Long_Term_Key_Request_Negative_Reply command is used to reply
  *        to an LE Long Term Key Request event from the Controller if the Host
  *        cannot provide a Long Term Key for this connection_handle. (See
  *        Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.26)
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_long_term_key_requested_negative_reply(uint16_t connection_handle);
/**
  * @brief The LE_Read_Supported_States command reads the states and state
  *        combinations that the link layer supports. See [Vol 6] Part B, Section
  *        1.1.1. le_states is an 8-octet bit field. If a bit is set to 1 then
  *        this state or state combination is supported by the Controller.
  *        Multiple bits in le_states may be set to 1 to indicate support for
  *        multiple state and state combinations. All the Advertising type with
  *        the Initiate State combinations shall be set only if the corresponding
  *        Advertising types and Master Role combination are set. All the
  *        Scanning types and the Initiate State combinations shall be set only
  *        if the corresponding Scanning types and Master Role combination are
  *        set. (See Bluetooth Specification v.4.1, Vol. 2, Part E, 7.8.27)
  * @param[out] le_states State or state combination is supported by the
  *             Controller. See Core v4.1, Vol.2, part E, Ch. 7.8.27.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_supported_states(uint8_t le_states[8]);
/**
  * @brief This command is used to start a test where the DUT receives test
  *        reference packets at a fixed interval. The tester generates the test
  *        reference packets. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.8.28)
  * @param rx_frequency
  *        Values:
  *        - 0x00 ... 0x27: N = (F - 2402) / 2.Frequency Range : 2402 MHz to 2480 MHz
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_receiver_test(uint8_t rx_frequency);
/**
  * @brief This command is used to start a test where the DUT generates test
  *        reference packets at a fixed interval. The Controller shall transmit
  *        at maximum power. An LE Controller supporting the LE_Transmitter_Test
  *        command shall support packet_payload values 0x00, 0x01 and 0x02. An LE
  *        Controller may support other values of packet_payload. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.8.29)
  * @param tx_frequency N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480
  *        MHz
  *        Values:
  *        - 0x00 ... 0x27
  * @param length_of_test_data Length in bytes of payload data in each packet.
  *        Supported ranges:       - (0x00,0x25): BlueNRG-1 and BlueNRG-2 with
  *        BLE stack version < 2.1       - (0x00,0xFF): BlueNRG-2 with BLE stack
  *        version >= 2.1 and extended packet length.
  *        Values:
  *        - 0x00 ... 0xFF
  * @param packet_payload Content of the Payload of the test reference packets.
  *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
  *        Repeated '11110000' (in transmission order) sequence 2: Repeated
  *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
  *        Repeated '11111111' (in transmission order) sequence 5: Repeated
  *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
  *        transmission order) sequence 7: Repeated '01010101' (in transmission
  *        order) sequence
  *        Values:
  *        - 0x00: PRBS9
  *        - 0x01: Repeated '11110000'
  *        - 0x02: Repeated '10101010'
  *        - 0x03: PRBS15
  *        - 0x04: Repeated '11111111'
  *        - 0x05: Repeated '00000000'
  *        - 0x06: Repeated '00001111'
  *        - 0x07: Repeated '01010101'
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_transmitter_test(uint8_t tx_frequency,
                                     uint8_t length_of_test_data,
                                     uint8_t packet_payload);
/**
  * @brief This command is used to stop any test which is in progress. The
  *        number_of_packets for a transmitter test shall be reported as 0x0000.
  *        The number_of_packets is an unsigned number and contains the number of
  *        received packets. (See Bluetooth Specification v.4.1, Vol. 2, Part E,
  *        7.8.30)
  * @param[out] number_of_packets Number of packets received.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_test_end(uint16_t *number_of_packets);
/**
  * @brief The LE_Set_Data_Length command allows the Host to suggest maximum
  *        transmission packet size and maximum packet transmission time
  *        (connMaxTxOctets and connMaxTxTime - see [Vol 6] Part B, Section
  *        4.5.10) to be used for a given connection. The Controller may use
  *        smaller or larger values based on local information.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param tx_octets Preferred maximum number of payload octets that the local
  *        Controller should include in a single Link Layer Data Channel PDU.
  *        Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF) Reserved for
  *        future use). Default: 27 bytes.
  *        Values:
  *        - 0x001B ... 0x00FB
  * @param tx_time Preferred maximum number of microseconds that the local
  *        Controller should use to transmit a single Link Layer Data Channel
  *        PDU. Range 0x0148-0x0848 (0x0000 - 0x0147 and 0x0849 - 0xFFFF Reserved
  *        for future use). Default: 328 bytes.
  *        Values:
  *        - 0x0148 ... 0x0848
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_data_length(uint16_t connection_handle,
                                    uint16_t tx_octets,
                                    uint16_t tx_time);
/**
  * @brief The LE_Read_Suggested_Default_Data_Length command allows the Host to
  *        read the Host preferred values for the Controller maximum transmitted
  *        number of payload octets and maximum packet transmission time to be
  *        used for new connections (connInitialMaxTxOctets and
  *        connInitialMaxTxTime - see ([Vol 6] Part B, Section 4.5.10).
  * @param[out] suggested_max_tx_octets The Host suggested value for the Controller
  *             maximum transmitted number of payload octets to be used for new
  *             connections - connInitialMaxTxOctets. Range 0x001B-0x00FB (0x0000
  *             - 0x001A and 0x00FC - 0xFFFF Reserved for future use) Default:
  *             0x001B
  * @param[out] suggested_max_tx_time The Host suggested value for the Controller
  *             maximum packet transmission time to be used for new connections -
  *             connInitialMaxTx-Time. Range 0x0148-0x0848 (0x0000 - 0x0147 and
  *             0x0849 - 0xFFFF Reserved for future use) Default: 0x0148
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_suggested_default_data_length(uint16_t *suggested_max_tx_octets,
                                                       uint16_t *suggested_max_tx_time);
/**
  * @brief The LE_Write_Suggested_Default_Data_Length command allows the Host to
  *        specify its preferred values for the Controller maximum transmission
  *        number of payload octets and maximum packet transmission time to be
  *        used for new connections (connInitialMaxTxOctets and
  *        connInitialMaxTxTime - see [Vol 6] Part B, Section 4.5.10). The
  *        Controller may use smaller or larger values based on local
  *        information.
  * @param suggested_max_tx_octets The Host suggested value for the Controller
  *        maximum transmitted number of payload octets to be used for new
  *        connections - connInitialMaxTxOctets. Range 0x001B-0x00FB (0x0000 -
  *        0x001A and 0x00FC - 0xFFFF Reserved for future use)
  *        Values:
  *        - 0x001B ... 0x00FB
  * @param suggested_max_tx_time The Host suggested value for the Controller maximum
  *        packet transmission time to be used for new connections -
