zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        connInitialMaxTx-Time. Range 0x0148-0x0848 (0x0000 - 0x0147 and 0x0849
  *        - 0xFFFF Reserved for future use)
  *        Values:
  *        - 0x0148 ... 0x0848
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_write_suggested_default_data_length(uint16_t suggested_max_tx_octets,
                                                        uint16_t suggested_max_tx_time);
/**
  * @brief The LE_Read_Local_P-256_Public_Key command is used to return the local
  *        P-256 public key from the Controller. The Controller shall generate a
  *        new P-256 public/private key pair upon receipt of this command. (See
  *        Bluetooth Specification v.4.2, Vol. 2, Part E, 7.8.36)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_local_p256_public_key(void);
/**
  * @brief The LE_Generate_DHKey command is used to initiate generation of a
  *        Diffie- Hellman key in the Controller for use over the LE transport.
  *        This command takes the remote P-256 public key as input. The Diffie-
  *        Hellman key generation uses the private key generated by
  *        LE_Read_Local_P256_Public_Key command. (See Bluetooth Specification
  *        v.4.2, Vol. 2, Part E, 7.8.37)
  * @param remote_p256_public_key The remote P-256 public key: X, Y format Octets
  *        31-0: X coordinate Octets 63-32: Y coordinate Little Endian Format
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_generate_dhkey(uint8_t remote_p256_public_key[64]);
/**
  * @brief The LE_Add_Device_To_Resolving_List command is used to add one device
  *        to the list of address translations used to resolve Resolvable Private
  *        Addresses in the Controller. This command cannot be used when address
  *        translation is enabled in the Controller and: - Advertising is enabled
  *        - Scanning is enabled - Create connection command is outstanding This
  *        command can be used at any time when address translation is disabled
  *        in the Controller. When a Controller cannot add a device to the
  *        resolving list because the list is full, it shall respond with error
  *        code 0x07 (Memory Capacity Exceeded). (See Bluetooth Specification
  *        v.4.2, Vol. 2, Part E, 7.8.38)
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @param peer_irk IRK of the peer device
  * @param local_irk IRK of the local device
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_add_device_to_resolving_list(uint8_t peer_identity_address_type,
                                                 uint8_t peer_identity_address[6],
                                                 uint8_t peer_irk[16],
                                                 uint8_t local_irk[16]);
/**
  * @brief The LE_Remove_Device_From_Resolving_List command is used to remove one
  *        device from the list of address translations used to resolve
  *        Resolvable Private Addresses in the controller. This command cannot be
  *        used when address translation is enabled in the Controller and: -
  *        Advertising is enabled - Scanning is enabled - Create connection
  *        command is outstanding This command can be used at any time when
  *        address translation is disabled in the Controller. When a Controller
  *        cannot remove a device from the resolving list because it is not
  *        found, it shall respond with error code 0x02 (Unknown Connection
  *        Identifier). (See Bluetooth Specification v.4.2, Vol. 2, Part E,
  *        7.8.39)
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_remove_device_from_resolving_list(uint8_t peer_identity_address_type,
                                                      uint8_t peer_identity_address[6]);
/**
  * @brief The LE_Clear_Resolving_List command is used to remove all devices from
  *        the list of address translations used to resolve Resolvable Private
  *        Addresses in the Controller. This command cannot be used when address
  *        translation is enabled in the Controller and: - Advertising is enabled
  *        - Scanning is enabled - Create connection command is outstanding This
  *        command can be used at any time when address translation is disabled
  *        in the Controller. (See Bluetooth Specification v.4.2, Vol. 2, Part E,
  *        7.8.40)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_clear_resolving_list(void);
/**
  * @brief The LE_Read_Resolving_List_Size command is used to read the total
  *        number of address translation entries in the resolving list that can
  *        be stored in the Controller. (See Bluetooth Specification v.4.2, Vol.
  *        2, Part E, 7.8.41)
  * @param[out] resolving_list_size Number of address translation entries in the
  *             resolving list
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_resolving_list_size(uint8_t *resolving_list_size);
/**
  * @brief The LE_Read_Peer_Resolvable_Address command is used to get the current
  *        peer Resolvable Private Address being used for the corresponding peer
  *        Public and Random (static) Identity Address. The peer's resolvable
  *        address being used may change after the command is called. This
  *        command can be used at any time. When a Controller cannot find a
  *        Resolvable Private Address associated with the Peer Identity Address,
  *        it shall respond with error code 0x02 (Unknown Connection Identifier).
  *        (See Bluetooth Specification v.4.2, Vol. 2, Part E, 7.8.42)
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @param[out] peer_resolvable_address Resolvable Private Address being used by
  *             the peer device
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_peer_resolvable_address(uint8_t peer_identity_address_type,
                                                 uint8_t peer_identity_address[6],
                                                 uint8_t peer_resolvable_address[6]);
/**
  * @brief The LE_Read_Local_Resolvable_Address command is used to get the
  *        current local Resolvable Private Address being used for the
  *        corresponding peer Identity Address. The local's resolvable address
  *        being used may change after the command is called. This command can be
  *        used at any time. When a Controller cannot find a Resolvable Private
  *        Address associated with the Peer Identity Address, it shall respond
  *        with error code 0x02 (Unknown Connection Identifier). (See Bluetooth
  *        Specification v.4.2, Vol. 2, Part E, 7.8.43)
  * @param peer_identity_address_type Identity address type.
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public or Random (static) Identity address of
  *        the peer device
  * @param[out] local_resolvable_address Resolvable Private Address being used by
  *             the local device
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_local_resolvable_address(uint8_t peer_identity_address_type,
                                                  uint8_t peer_identity_address[6],
                                                  uint8_t local_resolvable_address[6]);
/**
  * @brief The LE_Set_Address_Resolution_Enable command is used to enable
  *        resolution of Resolvable Private Addresses in the Controller. This
  *        causes the Controller to use the resolving list whenever the
  *        Controller receives a local or peer Resolvable Private Address. This
  *        command can be used at any time except when: - Advertising is enabled
  *        - Scanning is enabled - Create connection command is outstanding (See
  *        Bluetooth Specification v.4.2, Vol. 2, Part E, 7.8.44)
  * @param address_resolution_enable Enable/disable address resolution in the
  *        controller. 0x00: Address Resolution in controller disabled (default),
  *        0x01: Address Resolution in controller enabled
  *        Values:
  *        - 0x00: Address Resolution in controller disabled (default)
  *        - 0x01: Address Resolution in controller enabled
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_address_resolution_enable(uint8_t address_resolution_enable);
/**
  * @brief The LE_Set_Resolvable_Private_Address_Timeout command set the length
  *        of time the controller uses a Resolvable Private Address before a new
  *        resolvable private address is generated and starts being used. This
  *        timeout applies to all addresses generated by the controller. (See
  *        Bluetooth Specification v.4.2, Vol. 2, Part E, 7.8.45)
  * @param rpa_timeout rpa_timeout measured in seconds. Range for N: 0x0001 -
  *        0xA1B8 (1 sec - approximately 11.5 hours) Default: N= 0x0384 (900 secs
  *        or 15 minutes)
  *        Values:
  *        - 0x0001 ... 0xA1B8
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_resolvable_private_address_timeout(uint16_t rpa_timeout);
/**
  * @brief The LE_Read_Maximum_Data_Length command allows the Host to read the
  *        Controller  maximum supported payload octets and packet duration times
  *        for transmission and reception (supported_max_tx_octets and
  *        supported_max_tx_time, supported_max_rx_octets, and supported_max_rx_time, see
  *        [Vol 6] Part B, Section 4.5.10).
  * @param[out] supported_max_tx_octets Maximum number of payload octets that the
  *             local Controller supports for transmission of a single Link Layer
  *             Data Channel PDU. Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC
  *             - 0xFFFF Reserved for future use)
  * @param[out] supported_max_tx_time Maximum time, in microseconds, that the local
  *             Controller supports for transmission of a single Link Layer Data
  *             Channel PDU. Range 0x0148-0x0848 (0x0000 - 0x0147 and 0x0849 -
  *             0xFFFF Reserved for future use)
  * @param[out] supported_max_rx_octets Maximum number of payload octets that the
  *             local Controller supports for reception of a single Link Layer
  *             Data Channel PDU. Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC
  *             - 0xFFFF Reserved for future use)
  * @param[out] supported_max_rx_time Maximum time, in microseconds, that the local
  *             Controller supports for reception of a single Link Layer Data
  *             Channel PDU. Range 0x0148-0x0848 (0x0000 - 0x0147 and 0x0849 -
  *             0xFFFF Reserved for future use)
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_maximum_data_length(uint16_t *supported_max_tx_octets,
                                             uint16_t *supported_max_tx_time,
                                             uint16_t *supported_max_rx_octets,
                                             uint16_t *supported_max_rx_time);
/**
  * @brief The LE_Read_PHY command is used to read the current transmitter PHY
  *        and receiver PHY on the connection identified by the
  *        connection_handle.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param[out] tx_phy Transmitter PHY for the connection 0x01: The transmitter
  *             PHY for the connection is LE 1M 0x02: The transmitter PHY for the
  *             connection is LE 2M 0x03: The transmitter PHY for the connection
  *             is LE Coded
  *             Values:
  *             - 0x01: LE_1M_PHY
  *             - 0x02: LE_2M_PHY
  *             - 0x03: LE_CODED_PHY
  * @param[out] rx_phy Receiver PHY for the connection. 0x01: The receiver PHY
  *             for the connection is LE 1M 0x02: The receiver PHY for the
  *             connection is LE 2M 0x03: The receiver PHY for the connection is
  *             LE Coded All other values: Reserved for future use
  *             Values:
  *             - 0x01: The receiver PHY for the connection is LE 1M
  *             - 0x02: The receiver PHY for the connection is LE 2M
  *             - 0x03: The receiver PHY for the connection is LE Coded
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_phy(uint16_t connection_handle,
                             uint8_t *tx_phy,
                             uint8_t *rx_phy);
/**
  * @brief The LE_Set_Default_PHY command allows the Host to specify its
  *        preferred values for the transmitter PHY and receiver PHY to be used
  *        for all subsequent connections over the LE transport.
  * @param all_phys The all_phys parameter is a bit field that allows the Host to
  *        specify, for each direction, whether it has no preference among the
  *        PHYs that the Controller supports in a given direction or whether it
  *        has specified particular PHYs that it prefers in the tx_phys or
  *        rx_phys parameter. Bits: 0: The Host has no preference among the
  *        transmitter PHYs supported by the Controller 1: The Host has no
  *        preference among the receiver PHYs supported by the Controller
  *        Flags:
  *        - 0x01: No preference for TX
  *        - 0x02: No preference for RX
  * @param tx_phys The tx_phys parameter is a bit field that indicates the
  *        transmitter PHYs that the Host prefers the Controller to use. If the
  *        all_phys parameter specifies that the Host has no preference, the
  *        tx_phys parameter is ignored; otherwise at least one bit shall be set
  *        to 1. Bits: 0: The Host prefers to use the LE 1M transmitter PHY
  *        (possibly among others) 1: The Host prefers to use the LE 2M
  *        transmitter PHY (possibly among others) 2: The Host prefers to use the
  *        LE Coded transmitter PHY (possibly among others) 3-7: Reserved for
  *        future use
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param rx_phys The rx_phys parameter is a bit field that indicates the
  *        receiver PHYs that the Host prefers the Controller to use. If the
  *        all_phys parameter specifies that the Host has no preference, the
  *        rx_phys parameter is ignored; otherwise at least one bit shall be set
  *        to 1. Bits: 0: The Host prefers to use the LE 1M receiver PHY
  *        (possibly among others) 1: The Host prefers to use the LE 2M receiver
  *        PHY (possibly among others) 2: The Host prefers to use the LE Coded
  *        receiver PHY (possibly among others) 3-7: Reserved for future use
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_default_phy(uint8_t all_phys,
                                    uint8_t tx_phys,
                                    uint8_t rx_phys);
/**
  * @brief The LE_Set_PHY command is used to set the PHY preferences for the
  *        connection identified by the connection_handle. The Controller might
  *        not be able to make the change (e.g. because the peer does not support
  *        the requested PHY) or may decide that the current PHY is preferable.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param all_phys The all_phys parameter is a bit field that allows the Host to
  *        specify, for each direction, whether it has no preference among the
  *        PHYs that the Controller supports in a given direction or whether it
  *        has specified particular PHYs that it prefers in the tx_phys or
  *        rx_phys parameter. Bits: 0: The Host has no preference among the
  *        transmitter PHYs supported by the Controller 1: The Host has no
  *        preference among the receiver PHYs supported by the Controller
  *        Flags:
  *        - 0x01: No preference for TX
  *        - 0x02: No preference for RX
  * @param tx_phys The tx_phys parameter is a bit field that indicates the
  *        transmitter PHYs that the Host prefers the Controller to use. If the
  *        all_phys parameter specifies that the Host has no preference, the
  *        tx_phys parameter is ignored; otherwise at least one bit shall be set
  *        to 1. Bits: 0: The Host prefers to use the LE 1M transmitter PHY
  *        (possibly among others) 1: The Host prefers to use the LE 2M
  *        transmitter PHY (possibly among others) 2: The Host prefers to use the
  *        LE Coded transmitter PHY (possibly among others) 3-7: Reserved for
  *        future use
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param rx_phys The rx_phys parameter is a bit field that indicates the
  *        receiver PHYs that the Host prefers the Controller to use. If the
  *        all_phys parameter specifies that the Host has no preference, the
  *        rx_phys parameter is ignored; otherwise at least one bit shall be set
  *        to 1. Bits: 0: The Host prefers to use the LE 1M receiver PHY
  *        (possibly among others) 1: The Host prefers to use the LE 2M receiver
  *        PHY (possibly among others) 2: The Host prefers to use the LE Coded
  *        receiver PHY (possibly among others) 3-7: Reserved for future use
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param phy_options The phy_options parameter is a bit field that allows the
  *        Host to specify options for PHYs. The default value for a new
  *        connection shall be all zero bits. The Controller may override any
  *        preferred coding for transmitting on the LE Coded PHY. The Host may
  *        specify a preferred coding even if it prefers not to use the LE Coded
  *        transmitter PHY since the Controller may override the PHY preference.
  *        0 = the Host has no preferred coding when transmitting on the LE Coded
  *        PHY 1 = the Host prefers that S=2 coding be used when transmitting on
  *        the LE Coded PHY 2 = the Host prefers that S=8 coding be used when
  *        transmitting on the LE Coded PHY
  *        Values:
  *        - 0: No preferred LE Coded PHY
  *        - 1: S=2 preferred on LE Coded PHY
  *        - 2: S=8 preferred on LE Coded PHY
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_phy(uint16_t connection_handle,
                            uint8_t all_phys,
                            uint8_t tx_phys,
                            uint8_t rx_phys,
                            uint16_t phy_options);
/**
  * @brief This command is used to start a test where the DUT receives test
  *        reference packets at a fixed interval. The tester generates the test
  *        reference packets.
  * @param rx_channel Frequency Range : 2402 MHz to 2480 MHz N = (F - 2402) / 2.
  *        Values:
  *        - 0x00 ... 0x27: Frequency Range : 2402 MHz to 2480 MHz
  * @param phy PHY to be used by the receiver.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param modulation_index The modulation_index parameter specifies whether or
  *        not the Controller should assume the receiver has a stable modulation
  *        index.
  *        Values:
  *        - 0x00: Standard modulation index
  *        - 0x01: Stable modulation index
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_enhanced_receiver_test(uint8_t rx_channel,
                                           uint8_t phy,
                                           uint8_t modulation_index);
/**
  * @brief This command is used to start a test where the DUT generates test
  *        reference packets at a fixed interval. The Controller shall transmit
  *        at maximum power. An LE Controller supporting the LE_Enhanced
  *        Transmitter_Test command shall support packet_payload values 0x00,
  *        0x01 and 0x02. An LE Controller supporting the LE Coded PHY shall also
  *        support packet_payload value 0x04. An LE Controller may support other
  *        values of packet_payload.
  * @param tx_channel Frequency Range: 2402 MHz to 2480 MHz N = (F-2402) / 2
  *        Values:
  *        - 0x00 ... 0x27: Frequency Range: 2402 MHz to 2480 MHz
  * @param length_of_test_data
  *        Values:
  *        - 0x00 ... 0xFF: Length in bytes of payload data in each packet
  * @param packet_payload Content of the Payload of the test reference packets.
  *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
  *        Repeated '11110000' (in transmission order) sequence 2: Repeated
  *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
  *        Repeated '11111111' (in transmission order) sequence 5: Repeated
  *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
  *        transmission order) sequence 7: Repeated '01010101' (in transmission
  *        order) sequence
  *        Values:
  *        - 0x00: PRBS9
  *        - 0x01: Repeated '11110000'
  *        - 0x02: Repeated '10101010'
  *        - 0x03: PRBS15
  *        - 0x04: Repeated '11111111'
  *        - 0x05: Repeated '00000000'
  *        - 0x06: Repeated '00001111'
  *        - 0x07: Repeated '01010101'
  * @param phy PHY to be used by the transmitter.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_enhanced_transmitter_test(uint8_t tx_channel,
                                              uint8_t length_of_test_data,
                                              uint8_t packet_payload,
                                              uint8_t phy);
/**
  * @brief The LE_Set_Advertising_Set_Random_Address command is used by the Host
  *        to set the random device address specified by the random_address
  *        parameter. This address is used in the Controller (see [Vol 6] Part B,
  *        Section 1.3.2) for the advertiser's address contained in the
  *        advertising PDUs for the advertising set specified by the
  *        advertising_handle parameter. If the Host issues this command while an
  *        advertising set using connectable advertising is enabled, the
  *        Controller shall return the error code Command Disallowed (0x0C). The
  *        Host may issue this command at any other time. If this command is used
  *        to change the address, the new random address shall take effect for
  *        advertising no later than the next successful LE Extended Set
  *        Advertising Enable Command and for periodic advertising no later than
