zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        the next successful LE Periodic Advertising Enable Command.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @param advertising_random_address Random Device Address as defined by [Vol 6]
  *        Part B, Section 1.3.2
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_advertising_set_random_address(uint8_t advertising_handle,
                                                       uint8_t advertising_random_address[6]);
/**
  * @brief The LE_Set_Extended_Advertising_Parameters command is used by the Host
  *        to set the advertising parameters. The advertising_handle parameter
  *        identifies the advertising set whose parameters are being configured.
  *        The advertising_event_properties parameter describes the type of
  *        advertising event that is being configured and its basic properties.
  *        The type shall be one supported by the Controller.
  * @param advertising_handle The advertising_handle parameter identifies the
  *        advertising set whose parameters are being configured.
  *        Values:
  *        - 0x00 ... 0xEF
  * @param advertising_event_properties The advertising_event_properties
  *        parameter describes the type of advertising event that is being
  *        configured and its basic properties. The type shall be one supported
  *        by the Controller. Bits: 0 Connectable advertising 1 Scannable
  *        advertising 2 Directed advertising 3 High Duty Cycle Directed
  *        Connectable advertising (<= 3.75 ms Advertising Interval) 4 Use legacy
  *        advertising PDUs 5 Omit advertiser's address from all PDUs ("anonymous
  *        advertising") 6 Include TxPower in the extended header of the
  *        advertising PDU
  *        Flags:
  *        - 0x0001: Connectable
  *        - 0x0002: Scannable
  *        - 0x0004: Directed
  *        - 0x0008: HDC Directed Connectable
  *        - 0x0010: Legacy
  *        - 0x0020: Anonymous
  *        - 0x0040: TxPower in ext header
  * @param primary_advertising_interval_min Minimum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        ms; Time Range: 20 ms to 10,485.759375 s.
  *        Values:
  *        - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms)
  * @param primary_advertising_interval_max Maximum advertising interval for
  *        undirected and low duty cycle directed advertising. Time = N * 0.625
  *        ms; Time Range: 20 ms to 10,485.759375 s.
  *        Values:
  *        - 0x000020 (20.000 ms)  ... 0xFFFFFF (10485759.375 ms)
  * @param primary_advertising_channel_map The primary_advertising_channel_map is
  *        a bit field that indicates the advertising channels that shall be used
  *        when transmitting advertising packets. At least one channel bit shall
  *        be set in the primary_advertising_channel_map parameter.
  *        Flags:
  *        - 0x01: CH_37
  *        - 0x02: CH_38
  *        - 0x04: CH_39
  * @param own_address_type The own_address_type parameter specifies the type of
  *        address being used in the advertising packets. For random addresses,
  *        the address is specified by the LE_Set_Advertising_Set_Random_Address
  *        command.  0x00 Public Device Address 0x01 Random Device Address 0x02
  *        Controller generates the Resolvable Private Address based on the local
  *        IRK from the resolving list. If the resolving list contains no
  *        matching entry, use the public address. 0x03 Controller generates the
  *        Resolvable Private Address based on the local IRK from the resolving
  *        list. If the resolving list contains no matching entry, use the random
  *        address from LE_Set_Advertising_Set_Random_Address. All other values
  *        Reserved for future use
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Resolvable Private Address / Public Address
  *        - 0x03: Resolvable Private Address / Random Address
  * @param peer_address_type Peer Address type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @param advertising_filter_policy Advertising Filter Policy. This parameter is
  *        ignored when directed advertising is enabled.  0x00 Process scan and
  *        connection requests from all devices (i.e., the White List is not in
  *        use) 0x01 Process connection requests from all devices and scan
  *        requests only from devices that are in the White List 0x02 Process
  *        scan requests from all devices and connection requests only from
  *        devices that are in the White List. 0x03 Process scan and connection
  *        requests only from devices in the White List. All other values
  *        Reserved for future use
  *        Values:
  *        - 0x00: ADV_NO_WHITE_LIST_USE
  *        - 0x01: ADV_WHITE_LIST_FOR_ONLY_SCAN
  *        - 0x02: ADV_WHITE_LIST_FOR_ONLY_CONN
  *        - 0x03: ADV_WHITE_LIST_FOR_ALL
  * @param advertising_tx_power Units: dBm  The advertising_tx_power parameter
  *        indicates the maximum power level at which the advertising packets are
  *        to be transmitted on the advertising channels. The Controller shall
  *        choose a power level lower than or equal to the one specified by the
  *        Host.
  *        Values:
  *        - -127 ... 126
  *        - 127: No preference
  * @param primary_advertising_phy The primary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are transmitted on
  *        the primary advertising channel. If legacy advertising PDUs are being
  *        used, the primary_advertising_phy shall indicate the LE 1M PHY.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param secondary_advertising_max_skip The secondary_advertising_max_skip
  *        parameter is the maximum number of advertising events that can be
  *        skipped before the AUX_ADV_IND can be sent. 0x00 AUX_ADV_IND shall be
  *        sent prior to the next advertising event 0x01-0xFF Maximum advertising
  *        events the Controller can skip before sending the AUX_ADV_IND packets
  *        on the secondary advertising channel
  *        Values:
  *        - 0x00 ... 0xFF
  * @param secondary_advertising_phy The secondary_advertising_phy parameter
  *        indicates the PHY on which the advertising packets are transmitted on
  *        the secondary advertising channel.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param advertising_sid The advertising_sid parameter specifies the value to
  *        be transmitted in the Advertising SID subfield of the ADI field of the
  *        Extended Header of those advertising channel PDUs that have an ADI
  *        field. If the advertising set only uses PDUs that do not contain an
  *        ADI field, advertising_sid is ignored.
  *        Values:
  *        - 0x00 ... 0x0F
  * @param scan_request_notification_enable The scan_request_notification_enable
  *        parameter indicates whether the Controller shall send notifications
  *        upon the receipt of a scan request PDU that is in response to an
  *        advertisement from the specified advertising set that contains its
  *        device address and is from a scanner that is allowed by the
  *        advertising filter policy.
  *        Values:
  *        - 0x00: Scan request notifications disabled
  *        - 0x01: Scan request notifications enabled
  * @param[out] selected_tx_power Units: dBm. The selected_tx_power return
  *             parameter indicates the transmit power selected by the
  *             Controller. The Controller shall not change the transmit power
  *             for this advertising set without being directed to by the Host.
  *             Values:
  *             - -127 ... 126
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_advertising_parameters(uint8_t advertising_handle,
                                                        uint16_t advertising_event_properties,
                                                        uint8_t primary_advertising_interval_min[3],
                                                        uint8_t primary_advertising_interval_max[3],
                                                        uint8_t primary_advertising_channel_map,
                                                        uint8_t own_address_type,
                                                        uint8_t peer_address_type,
                                                        uint8_t peer_address[6],
                                                        uint8_t advertising_filter_policy,
                                                        int8_t advertising_tx_power,
                                                        uint8_t primary_advertising_phy,
                                                        uint8_t secondary_advertising_max_skip,
                                                        uint8_t secondary_advertising_phy,
                                                        uint8_t advertising_sid,
                                                        uint8_t scan_request_notification_enable,
                                                        int8_t *selected_tx_power);
/**
  * @brief The LE_Set_Extended_Advertising_Data command is used to set the data
  *        used in advertising PDUs that have a data field. This command may be
  *        issued at any time after an advertising set identified by the
  *        advertising_handle parameter has been created using the LE Set
  *        Extended Advertising Parameters Command (see Section 7.8.53),
  *        regardless of whether advertising in that set is enabled or disabled.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @param operation The Host may set the advertising data in one or more
  *        operations using this parameter. 0x00: Intermediate fragment of
  *        fragmented extended advertising data 0x01: First fragment of
  *        fragmented extended advertising data 0x02: Last fragment of fragmented
  *        extended advertising data 0x03: Complete extended advertising data
  *        0x04: Unchanged data (just update the Advertising DID) All other
  *        values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  *        - 0x04: Unchanged data
  * @param fragment_preference The fragment_preference parameter provides a hint
  *        to the Controller as to whether advertising data should be fragmented.
  *        Values:
  *        - 0x00: The Controller may fragment
  *        - 0x01: The Controller should not fragment or should minimize fragmentation
  * @param advertising_data_length The number of octets in the Advertising Data
  *        parameter
  *        Values:
  *        - 0 ... 251
  * @param advertising_data Advertising data formatted as defined in [Vol 3] Part
  *        C, Section 11 Note: This parameter has a variable length.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_advertising_data(uint8_t advertising_handle,
                                                  uint8_t operation,
                                                  uint8_t fragment_preference,
                                                  uint8_t advertising_data_length,
                                                  uint8_t advertising_data[]);
/**
  * @brief The LE_Set_Extended_Scan_Response_Data command is used to provide scan
  *        response data used in scanning response PDUs. This command may be
  *        issued at any time after the advertising set identified by the
  *        advertising_handle parameter has been created using the LE Set
  *        Extended Advertising Parameters Command (see Section 7.8.53)
  *        regardless of whether advertising in that set is enabled or disabled.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @param operation The Host may set the scan response data in one or more
  *        operations using the operation parameter in the command. 0x00:
  *        Intermediate fragment of fragmented scan response data 0x01: First
  *        fragment of fragmented scan response data 0x02: Last fragment of
  *        fragmented scan response data 0x03: Complete scan response data All
  *        other values: Reserved for future use
  *        Values:
  *        - 0x00: Intermediate fragment
  *        - 0x01: First fragment
  *        - 0x02: Last fragment
  *        - 0x03: Complete data
  * @param fragment_preference The fragment_preference parameter provides a hint
  *        to the Controller as to whether advertising data should be fragmented.
  *        Values:
  *        - 0x00: The Controller may fragment all scan response data
  *        - 0x01: The Controller should not fragment or should minimize fragmentation of
scan response data
  * @param scan_response_data_length The number of octets in the Scan_Response
  *        Data parameter
  *        Values:
  *        - 0x00 ... 0xFB: The number of octets in the Scan_Response Data parameter
  * @param scan_response_data Scan response data formatted as defined in [Vol 3]
  *        Part C, Section 11 Note: This parameter has a variable length.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_scan_response_data(uint8_t advertising_handle,
                                                    uint8_t operation,
                                                    uint8_t fragment_preference,
                                                    uint8_t scan_response_data_length,
                                                    uint8_t scan_response_data[]);
/**
  * @brief The LE_Set_Extended_Advertising_Enable command is used to request the
  *        Controller to enable or disable one or more advertising sets using the
  *        advertising sets identified by the advertising_handle[i] parameter.
  *        The Controller manages the timing of advertisements in accordance with
  *        the advertising parameters given in the
  *        LE_Set_Extended_Advertising_Parameters command.
  * @param Enable It allows to enable or disable one or more advertising sets
  *        using the advertising sets identified by the advertising_handle[i]
  *        parameter.
  *        Values:
  *        - 0x00: Disable
  *        - 0x01: Enable
  * @param number_of_sets The number_of_sets parameter is the number of
  *        advertising sets contained in the parameter arrays.
  *        Values:
  *        - 0x00: Disable all advertising sets
  *        - 0x01 ... 0x3F: Number of advertising sets to enable or disable
  * @param advertising_set_parameters See @ref advertising_set_parameters_t
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_advertising_enable(uint8_t Enable,
                                                    uint8_t number_of_sets,
                                                    advertising_set_parameters_t advertising_set_parameters[]);
/**
  * @brief The LE_Read_Maximum_Advertising_Data_Length command is used to read
  *        the maximum length of data supported by the Controller for use as
  *        advertisement data or scan response data in an advertising event or as
  *        periodic advertisement data. Note: The maximum amount may be
  *        fragmented across multiple PDUs (see [Vol 6] Part B, Section 2.3.4.9).
  * @param[out] maximum_advertising_data_length Maximum length of data supported
  *             by the Controller for use as advertisement data or scan response
  *             data in an advertising event or as periodic advertisement data.
  *             Values:
  *             - 0x001F ... 0x0672: Maximum supported advertising data length
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_maximum_advertising_data_length(uint16_t *maximum_advertising_data_length);
/**
  * @brief The LE_Read_Number_of_Supported_Advertising_Sets command is used to
  *        read the maximum number of advertising sets supported by the
  *        advertising Controller at the same time. Note: The number of
  *        advertising sets that can be supported is not fixed and the Controller
  *        can change it at any time because the memory used to store advertising
  *        sets can also be used for other purposes.
  * @param[out] num_supported_advertising_sets Maximum number of advertising sets
  *             supported by the advertising Controller at the same time.
  *             Values:
  *             - 0x01 ... 0xF0: Number of advertising sets supported at the same time
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_number_of_supported_advertising_sets(uint8_t *num_supported_advertising_sets);
/**
  * @brief The LE_Remove_Advertising_Set command is used to remove an advertising
  *        set from the Controller. If the advertising set corresponding to the
  *        advertising_handle parameter does not exist, then the Controller shall
  *        return the error code Unknown Advertising Identifier (0x42). If
  *        advertising on the advertising set is enabled, then the Controller
  *        shall return the error code Command Disallowed (0x0C).
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_remove_advertising_set(uint8_t advertising_handle);
/**
  * @brief The LE_Clear_Advertising_Sets command is used to remove all existing
  *        advertising sets from the Controller. If advertising is enabled on any
  *        advertising set, then the Controller shall return the error code
  *        Command Disallowed (0x0C). Note: All advertising sets are cleared on
  *        HCI reset.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_clear_advertising_sets(void);
/**
  * @brief The LE_Set_Periodic_Advertising_Parameters command is used by the Host
  *        to set the parameters for periodic advertising. The advertising_handle
  *        parameter identifies the advertising set whose periodic advertising
  *        parameters are being configured. If the corresponding advertising set
  *        does not already exist, then the Controller shall return the error
  *        code Unknown Advertising Identifier (0x42). The
  *        periodic_advertising_interval_min parameter shall be less than or
  *        equal to the periodic_advertising_interval_max parameter. The
  *        periodic_advertising_interval_min and
  *        periodic_advertising_interval_max parameters should not be the same
  *        value to enable the Controller to determine the best advertising
  *        interval given other activities. The periodic_advertising_properties
  *        parameter indicates which fields should be included in the advertising
  *        packet. If the advertising set identified by the advertising_handle
  *        specified anonymous advertising, the Controller shall return the error
  *        code Invalid HCI Parameters (0x12). If the Host issues this command
  *        when periodic advertising is enabled for the specified advertising
  *        set, the Controller shall return the error code Command Disallowed
  *        (0x0C). If the advertising_handle does not identify an advertising set
  *        that is already configured for periodic advertising and the Controller
  *        is unable to support more periodic advertising at present, the
  *        Controller shall return the error code Memory Capacity Exceeded (0x07)
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify a periodic advertisement
  * @param periodic_advertising_interval_min Minimum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Minimum advertising interval for periodic advertising.
  * @param periodic_advertising_interval_max Maximum advertising interval for
  *        periodic advertising. Time = N * 1.25 ms; Time Range: 7.5ms to
  *        81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Maximum advertising interval for periodic advertising.
  * @param periodic_advertising_properties The periodic_advertising_properties
  *        parameter indicates which fields should be included in the advertising
  *        packet.
  *        Flags:
  *        - 0x0040: Include TxPower in the advertising PDU
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_periodic_advertising_parameters(uint8_t advertising_handle,
                                                        uint16_t periodic_advertising_interval_min,
                                                        uint16_t periodic_advertising_interval_max,
                                                        uint16_t periodic_advertising_properties);
/**
  * @brief The LE_Set_Periodic_Advertising_Data command is used to set the data
  *        used in periodic advertising PDUs. This command may be issued at any
  *        time after the advertising set identified by the advertising_handle
  *        parameter has been configured for periodic advertising using the
  *        LE_Set_Periodic_Advertising_Parameters Command (see Section 7.8.61),
  *        regardless of whether advertising in that set is enabled or disabled.
  *        If the advertising set has not been configured for periodic
  *        advertising, then the Controller shall return the error code Command
  *        Disallowed (0x0C). If advertising is currently enabled for the
  *        specified advertising set, the Controller shall use the new data in
  *        subsequent periodic advertising events for this advertising set. If a
  *        periodic advertising event is in progress when this command is issued,
  *        the Controller may use the old or new data for that event. If periodic
  *        advertising is currently disabled for the specified advertising set,
  *        the data shall be kept by the Controller and used once periodic
  *        advertising is enabled for that set. The data shall be discarded when
  *        the advertising set is removed. Only the significant part of the
  *        periodic advertising data should be transmitted in the advertising
  *        packets as defined in [Vol 3] Part C, Section 11. The Host may set the
  *        periodic advertising data in one or more operations using the
  *        operation parameter in the command. If the combined length of the data
  *        exceeds the capacity of the advertising set identified by the
  *        advertising_handle parameter (see Section 7.8.57 LE Read Maximum
  *        Advertising Data Length Command) or the amount of memory currently
