zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        available, all the data shall be discarded and the Controller shall
  *        return the error code Memory Capacity Exceeded (0x07). If operation
  *        indicates the start of new data (values 0x01 or 0x03), then any
  *        existing partial or complete data shall be discarded. If the
  *        advertising_data_length parameter is 0, then operation shall be 0x03;
  *        this indicates that any existing partial or complete data shall be
  *        deleted and no new data provided.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @param operation The Host may set the periodic advertising data in one or
  *        more operations using the operation parameter in the command.
  *        Values:
  *        - 0x00: Intermediate fragment of fragmented periodic advertising data
  *        - 0x01: First fragment of fragmented periodic advertising data
  *        - 0x02: Last fragment of fragmented periodic advertising data
  *        - 0x03: Complete periodic advertising data
  * @param advertising_data_length The number of octets in the Advertising Data
  *        parameter
  *        Values:
  *        - 0 ... 252: The number of octets in the Advertising Data parameter
  * @param advertising_data Periodic advertising data formatted as defined in
  *        [Vol 3] Part C, Section 11. Note: This parameter has a variable
  *        length.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_periodic_advertising_data(uint8_t advertising_handle,
                                                  uint8_t operation,
                                                  uint8_t advertising_data_length,
                                                  uint8_t advertising_data[]);
/**
  * @brief The LE_Set_Periodic_Advertising_Enable command is used to request the
  *        Controller to enable or disable the periodic advertising for the
  *        advertising set specified by the advertising_handle parameter
  *        (ordinary advertising is not affected). If the advertising set is not
  *        currently enabled (see the LE_Set_Extended_Advertising_Enable
  *        command), the periodic advertising is not started until the
  *        advertising set is enabled. Once the advertising set has been enabled,
  *        the Controller shall continue periodic advertising until the Host
  *        issues an LE_Set_Periodic_Advertising_Enable command with Enable set
  *        to 0x00 (periodic advertising is disabled). Disabling the advertising
  *        set has no effect on the periodic advertising once the advertising set
  *        has been enabled. The Controller manages the timing of advertisements
  *        in accordance with the advertising parameters given in the
  *        LE_Set_Periodic_Advertising_Parameters command. If the advertising set
  *        corresponding to the advertising_handle parameter does not exist, the
  *        Controller shall return the error code Unknown Advertising Identifier
  *        (0x42). If the periodic advertising data in the advertising set is not
  *        complete, the Controller shall return the error code Command
  *        Disallowed (0x0C). Note: Enabling periodic advertising when it is
  *        already enabled can cause the random address to change. Disabling
  *        periodic advertising when it is already disabled has no effect.
  * @param enable It is used to request the Controller to enable or disable the
  *        periodic advertising for the advertising set specified by the
  *        advertising_handle parameter (ordinary advertising is not affected).
  *        Values:
  *        - 0x00: Periodic advertising is disabled (default)
  *        - 0x01: Periodic advertising is enabled
  * @param advertising_handle
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_periodic_advertising_enable(uint8_t enable,
                                                    uint8_t advertising_handle);
/**
  * @brief The LE_Set_Extended_Scan_Parameters command is used to set the
  *        extended scan parameters to be used on the advertising channels. The
  *        scanning_phys parameter indicates the PHY(s) on which the advertising
  *        packets should be received on the primary advertising channel. The
  *        Host may enable one or more scanning PHYs. The scan_type[i],
  *        scan_interval[i], and scan_window[i] parameters array elements are
  *        ordered in the same order as the set bits in the Scanning_PHY
  *        parameter, starting from bit 0. The number of array elements is
  *        determined by the number of bits set in the Scanning_PHY parameter.
  *        The scan_type[i] parameter specifies the type of scan to perform. The
  *        scan_interval[i] and scan_window[i] parameters are recommendations
  *        from the Host on how long (scan_window[i]) and how frequently
  *        (scan_interval[i]) the Controller should scan (see [Vol 6] Part B,
  *        Section 4.5.3); however the frequency and length of the scan is
  *        implementation specific. If the requested scan cannot be supported by
  *        the implementation, the Controller shall return the error code Invalid
  *        HCI Command Parameters (0x12). The own_address_type parameter
  *        indicates the type of address being used in the scan request packets.
  *        If the Host issues this command when scanning is enabled in the
  *        Controller, the Controller shall return the error code Command
  *        Disallowed (0x0C).
  * @param own_address_type The own_address_type parameter indicates the type of
  *        address being used in the scan request packets.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
  *        - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from LE_Set_Random_Address.
  * @param scanning_filter_policy 0x00 Accept all advertisement packets. Directed
  *        advertising packets which are not addressed for this device shall be
  *        ignored. 0x01 Ignore advertisement packets from devices not in the
  *        White List Only. Directed advertising packets which are not addressed
  *        for this device shall be ignored 0x02 Accept all undirected
  *        advertisement packets. Directed advertisement packets where initiator
  *        address is a RPA and  Directed advertisement packets addressed to this
  *        device shall be accepted. 0x03 Accept all undirected advertisement
  *        packets from devices that are in the White List.Directed advertisement
  *        packets where initiator address is RPA and Directed advertisement
  *        packets addressed to this device shall be accepted.
  *        Values:
  *        - 0x00: Accept all
  *        - 0x01: Ignore devices not in the White List
  *        - 0x02: Accept all (use resolving list)
  *        - 0x03: Ignore devices not in the White List (use resolving list)
  * @param scanning_phys The scanning_phys parameter indicates the PHY(s) on
  *        which the advertising packets should be received on the primary
  *        advertising channel. The Host may enable one or more scanning PHYs.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param extended_scan_parameters See @ref extended_scan_parameters_t
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_scan_parameters(uint8_t own_address_type,
                                                 uint8_t scanning_filter_policy,
                                                 uint8_t scanning_phys,
                                                 extended_scan_parameters_t extended_scan_parameters[]);
/**
  * @brief The LE_Set_Extended_Scan_Enable command is used to enable or disable
  *        scanning. The Enable parameter determines whether scanning is enabled
  *        or disabled. If it is disabled, the remaining parameters are ignored.
  *        The filter_duplicates parameter controls whether the Link Layer should
  *        filter out duplicate advertising reports (filtering duplicates
  *        enabled) to the Host or if the Link Layer should generate advertising
  *        reports for each packet received (filtering duplicates disabled). See
  *        [Vol 6] Part B, Section 4.4.3.5. If the filter_duplicates parameter is
  *        set to 0x00, all advertisements received from advertisers shall be
  *        sent to the Host in advertising report events. If the
  *        filter_duplicates parameter is set to 0x01, duplicate advertisements
  *        should not be sent to the Host in advertising report events until
  *        scanning is disabled. If the filter_duplicates parameter is set to
  *        0x02, duplicate advertisements in a single scan period should not be
  *        sent to the Host in advertising report events; this setting shall only
  *        be used if Period is non-zero. If filter_duplicates is set to 0x2 and
  *        Period to zero, the Controller shall return the Invalid error code HCI
  *        Command Parameters (0x12). If the Duration parameter is zero or both
  *        the Duration parameter and Period parameter are non-zero, the
  *        Controller shall continue scanning until scanning is disabled by the
  *        Host issuing an LE_Set_Extended_Scan_Enable command with the Enable
  *        parameter set to 0x00 (Scanning is disabled). The Period parameter is
  *        ignored when the Duration parameter is zero. If the Duration parameter
  *        is non-zero and the Period parameter is zero, the Controller shall
  *        continue scanning until the duration specified in the Duration
  *        parameter has expired. If both the Duration and Period parameters are
  *        non-zero and the Duration parameter is greater than or equal to the
  *        Period parameter, the Controller shall return the error code Invalid
  *        HCI Command Parameters (0x12). When the Duration and Period parameters
  *        are non-zero, the Controller shall scan for the duration of the
  *        Duration parameter within a scan period specified by the Period
  *        parameter. After the scan period has expired, a new scan period shall
  *        begin and scanning shall begin again for the duration specified. The
  *        scan periods continue until the Host disables scanning. If the
  *        LE_Set_Extended_Scan_Enable command is sent while scanning is enabled,
  *        the timers used for duration and period are reset to the new parameter
  *        values and a new scan period is started. Any change to the
  *        filter_duplicates setting or the random address shall take effect.
  *        Note: Disabling scanning when it is disabled has no effect. Note: The
  *        duration of a scan period refers to the time spent scanning on both
  *        the primary and secondary advertising channels. However, expiry of the
  *        duration does not prevent the Link Layer from scanning for and
  *        receiving auxiliary packets of received advertisements. If the
  *        scanning parameters' own_address_type parameter is set to 0x01 or 0x03
  *        and the random address for the device has not been initialized, the
  *        Controller shall return the error code Invalid HCI Command Parameters
  *        (0x12).
  * @param enable The Enable parameter determines whether scanning is enabled or
  *        disabled. If it is disabled, the remaining parameters are ignored.
  *        Values:
  *        - 0x00: Scanning disabled
  *        - 0x01: Scanning enabled
  * @param filter_duplicates The filter_duplicates parameter controls whether the
  *        Link Layer should filter out duplicate advertising reports (filtering
  *        duplicates enabled) to the Host or if the Link Layer should generate
  *        advertising reports for each packet received (filtering duplicates
  *        disabled). See [Vol 6] Part B, Section 4.4.3.5.
  *        Values:
  *        - 0x00: Duplicate filtering disabled
  *        - 0x01: Duplicate filtering enabled
  *        - 0x02: Duplicate filtering enabled, reset for each scan period
  * @param duration Scan duration. Time = N * 10 ms; Time Range: 10 ms to 655.35
  *        s.
  *        Values:
  *        - 0x0000 (0.000 ms) : Scan continuously until explicitly disable
  *        - 0x0001 (0.625 ms)  ... 0xFFFF (40959.375 ms) : Scan duration
  * @param period Time interval from when the Controller started its last
  *        Scan_Duration until it begins the subsequent Scan_Duration. Time = N *
  *        1.28 sec; Time Range: 1.28 s to 83,884.8 s.
  *        Values:
  *        - 0x0000: Periodic scanning disabled
  *        - 0x0001 ... 0xFFFF: Time interval from when the Controller started its last Scan_Duration
until it begins the subsequent Scan_Duration
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_extended_scan_enable(uint8_t enable,
                                             uint8_t filter_duplicates,
                                             uint16_t duration,
                                             uint16_t period);
/**
  * @brief The LE_Extended_Create_Connection command is used to create a Link
  *        Layer connection to a connectable advertiser.
  *        LE_Extended_Create_Connection command can be used in place of
  *        LE_Create_Connection command.
  * @param initiating_filter_policy The initiator_filter_policy parameter is used
  *        to determine whether the White List is used. If the White List is not
  *        used, the peer_address_type and the peer_address parameters specify
  *        the address type and address of the advertising device to connect to.
  *        0x00 - White List is not used to determine which advertiser to connect
  *        to. peer_address_type and peer_address shall be used. 0x01 - White
  *        List is used to determine which advertiser to connect to.
  *        peer_address_type and peer_address shall be ignored.
  *        Values:
  *        - 0x00: WHITELIST_IS_NOT_USED
  *        - 0x01: WHITELIST_IS_USED
  * @param own_address_type The own_address_type parameter indicates the type of
  *        address being used in the connection request packets.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the public address.
  *        - 0x03: Controller generates the Resolvable Private Address based on the local
IRK from the resolving list. If the resolving list contains no matching
entry, then use the random address from the most recent successful
LE_Set_Random_Address Command.
  * @param peer_address_type The peer_address_type parameter indicates the type
  *        of address used in the connectable advertisement sent by the peer.
  *        0x00: Public Device Address or Public Identity Address 0x01: Random
  *        Device Address or Random (static) Identity Address
  *        Values:
  *        - 0x00: Public Address
  *        - 0x01: Random Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address, or Random (static) Identity Address of the device to
  *        be connected.
  * @param initiating_phys The initiating_phys parameter indicates the PHY(s) on
  *        which the advertising packets should be received on the primary
  *        advertising channel and the PHYs for which connection parameters have
  *        been specified. The Host may enable one or more initiating PHYs. 0x01:
  *        Scan connectable advertisements on the LE 1M PHY. Connection
  *        parameters for the LE 1M PHY are provided. 0x02: Connection parameters
  *        for the LE 2M PHY are provided 0x04: Scan connectable advertisements
  *        on the LE Coded PHY. Connection parameters for the LE Coded PHY are
  *        provided.
  *        Flags:
  *        - 0x01: LE_1M_PHY_BIT
  *        - 0x02: LE_2M_PHY_BIT
  *        - 0x04: LE_CODED_PHY_BIT
  * @param ext_create_conn_param See @ref
  *        extended_create_connection_parameters_t
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_extended_create_connection(uint8_t initiating_filter_policy,
                                               uint8_t own_address_type,
                                               uint8_t peer_address_type,
                                               uint8_t peer_address[6],
                                               uint8_t initiating_phys,
                                               extended_create_connection_parameters_t ext_create_conn_param[]);
/**
  * @brief The LE_Periodic_Advertising_Create_Sync command is used to synchronize
  *        with periodic advertising from an advertiser and begin receiving
  *        periodic advertising packets. This command may be issued whether or
  *        not scanning is enabled and scanning may be enabled and disabled (see
  *        the LE Set Extended Scan Enable Command) while this command is
  *        pending. However, synchronization can only occur when scanning is
  *        enabled. While scanning is disabled, no attempt to synchronize will
  *        take place. The Filter_Policy parameter is used to determine whether
  *        the Periodic Advertiser List is used. If the Periodic Advertiser List
  *        is not used, the advertising_sid, Advertiser address_type, and
  *        Advertiser Address parameters specify the periodic advertising device
  *        to listen to; otherwise they are ignored. The advertising_sid
  *        parameter, if used, specifies the value that must match the
  *        Advertising SID subfield in the ADI field of the received
  *        advertisement for it to be used to synchronize. The Skip parameter
  *        specifies the number of consecutive periodic advertising packets that
  *        the receiver may skip after successfully receiving a periodic
  *        advertising packet. The sync_timeout parameter specifies the maximum
  *        permitted time between successful receives. If this time is exceeded,
  *        synchronization is lost. The Unused parameter is reserved for future
  *        use. Irrespective of the value of the Skip parameter, the Controller
  *        should stop skipping packets before the sync_timeout would be
  *        exceeded. If the Host issues this command when another
  *        LE_Periodic_Advertising_Create_Sync command is pending (see page
  *        1380), the Controller shall return the error code Command Disallowed
  *        (0x0C). If the Host issues this command for a periodic advertising set
  *        from an advertiser that the Controller is already synchronized to, the
  *        Controller shall return the error code Connection Already Exists
  *        (0x0B).
  * @param options The options parameter is used to determine whether the
  *        Periodic Advertiser List is used and whether
  *        HCI_Periodic_Advertising_Report events for this periodic advertising
  *        train are initially enabled or disabled. If bit 0 is set, the Periodic
  *        Advertiser List is used to determine which advertiser to listen to. If
  *        the Periodic Advertiser List is not used, the advertising_sid,
  *        Advertiser address_type, and Advertiser Address parameters specify the
  *        periodic advertising device to listen to; otherwise they shall be
  *        ignored. If bit 1 is set, reporting is initially disabled, otherwise
  *        it is enabled.
  *        Flags:
  *        - 0x01: USE_PERIODIC_ADV_LIST
  *        - 0x02: DISABLE_REPORTING
  * @param advertising_sid The advertising_sid parameter, if used, specifies the
  *        value that must match the Advertising SID subfield in the ADI field of
  *        the received advertisement for it to be used to synchronize.
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
Advertising
  * @param advertising_address_type Advertising address type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param sync_timeout Synchronization timeout for the periodic advertising
  *        train. Time = N*10 ms.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms)
  * @param sync_cte_type The sync_cte_type parameter specifies whether to only
  *        synchronize to periodic advertising with certain types of Constant
  *        Tone Extension (a value of 0 indicates that the presence or absence of
  *        a Constant Tone Extension is irrelevant). If the periodic advertising
  *        has the wrong type of Constant Tone Extension then: - If bit 0 of
  *        options is set, the Controller shall ignore this address and SID and
  *        continue to search for other periodic advertisements. - Otherwise, the
  *        Controller shall cancel the synchronization with the error code
  *        Unsupported Remote Feature/Unsupported LMP Feature (0x1A).
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond
slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds
slots
  *        - 0x08: Do not sync to packets with a type 3 Constant Tone Extension (currently
reserved for future use)
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_periodic_advertising_create_sync(uint8_t options,
                                                     uint8_t advertising_sid,
                                                     uint8_t advertising_address_type,
                                                     uint8_t advertising_address[6],
                                                     uint16_t skip,
                                                     uint16_t sync_timeout,
                                                     uint8_t sync_cte_type);
/**
  * @brief The LE_Periodic_Advertising_Create_Sync_Cancel command is used to
  *        cancel the LE_Periodic_Advertising_Create_Sync command while it is
  *        pending. If the Host issues this command while no
  *        LE_Periodic_Advertising_Create_Sync command is pending, the Controller
  *        shall return the error code Command Disallowed (0x0C).
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_periodic_advertising_create_sync_cancel(void);
/**
  * @brief The LE_Periodic_Advertising_Terminate_Sync command is used to stop
  *        reception of the periodic advertising identified by the sync_handle
