zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        parameter. If the Host issues this command when another
  *        LE_Periodic_Advertising_Create_Sync command is pending (see below),
  *        the Controller shall return the error code Command Disallowed (0x0C).
  *        If the periodic advertising corresponding to the sync_handle parameter
  *        does not exist, then the Controller shall return the error code
  *        Unknown Advertising Identifier (0x42).
  * @param sync_handle It is used to identify the periodic advertiser
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle to be used to identify the periodic advertiser
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_periodic_advertising_terminate_sync(uint16_t sync_handle);
/**
  * @brief The LE_Add_Device_To_Periodic_Advertiser_List command is used to add a
  *        single device to the Periodic Advertiser list stored in the
  *        Controller. Any additions to the Periodic Advertiser list take effect
  *        immediately. If the device is already on the list, the Controller
  *        shall return the error code Invalid HCI Command Parameters (0x12). If
  *        the Host issues this command when an
  *        LE_Periodic_Advertising_Create_Sync command is pending, the Controller
  *        shall return the error code Command Disallowed (0x0C). When a
  *        Controller cannot add a device to the Periodic Advertiser list because
  *        the list is full, the Controller shall return the error code Memory
  *        Capacity Exceeded (0x07).
  * @param advertiser_address_type Advertiser Address Type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertising_sid Advertising SID subfield in the ADI field used to
  *        identify the Periodic Advertising
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
Advertising
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_add_device_to_periodic_advertiser_list(uint8_t advertiser_address_type,
                                                           uint8_t advertising_address[6],
                                                           uint8_t advertising_sid);
/**
  * @brief The LE_Remove_Device_From_Periodic_Advertiser_List command is used to
  *        remove one device from the list of Periodic Advertisers stored in the
  *        Controller. Removals from the Periodic Advertisers List take effect
  *        immediately. If the Host issues this command when an
  *        LE_Periodic_Advertising_Create_Sync command is pending, the Controller
  *        shall return the error code Command Disallowed (0x0C). When a
  *        Controller cannot remove a device from the Periodic Advertiser list
  *        because it is not found, the Controller shall return the error code
  *        Unknown Advertising Identifier (0x42).
  * @param advertiser_address_type Advertising Address type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertising_sid It is used to  identify the Periodic Advertising
  *        Values:
  *        - 0x00 ... 0x0F: Advertising SID subfield in the ADI field used to identify the Periodic
Advertising
All other values Reserved for future
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_remove_device_from_periodic_advertising_list(uint8_t advertiser_address_type,
                                                                 uint8_t advertising_address[6],
                                                                 uint8_t advertising_sid);
/**
  * @brief The LE_Clear_Periodic_Advertiser_List command is used to remove all
  *        devices from the list of Periodic Advertisers in the Controller. If
  *        this command is used when an LE_Periodic_Advertising_Create_Sync
  *        command is pending, the Controller shall return the error code Command
  *        Disallowed (0x0C).
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_clear_periodic_advertiser_list(void);
/**
  * @brief The LE_Read_Periodic_Advertiser_List_Size command is used to read the
  *        total number of Periodic Advertiser list entries that can be stored in
  *        the Controller. Note: The number of entries that can be stored is not
  *        fixed and the Controller can change it at any time (e.g., because the
  *        memory used to store the list can also be used for other purposes).
  * @param[out] periodic_advertiser_list_size Total number of Periodic Advertiser
  *             list entries that can be stored in the Controller
  *             Values:
  *             - 0x1F ... 0xFF: Total number of Periodic Advertiser list entries that can be stored in the
Controller
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_periodic_advertiser_list_size(uint8_t *periodic_advertiser_list_size);
/**
  * @brief The HCI_LE_Read_Transmit_Power command is used to read the minimum and
  *        maximum transmit powers supported by the Controller.
  * @param[out] min_tx_power Minimum supported TX power (units: dBm).
  *             Values:
  *             - -127 ... 20
  * @param[out] max_tx_power Maximum supported TX power (units: dBm).
  *             Values:
  *             - -127 ... 20
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_transmit_power(int8_t *min_tx_power,
                                        int8_t *max_tx_power);
/**
  * @brief The HCI_LE_Read_RF_Path_Compensation command is used to read the RF
  *        Path Compensation Values parameter used in the Tx Power Level and RSSI
  *        calculation.
  * @param[out] rf_tx_path_compensation_value
  * @param[out] rf_rx_path_compensation_value
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_rf_path_compensation(int16_t *rf_tx_path_compensation_value,
                                              int16_t *rf_rx_path_compensation_value);
/**
  * @brief The HCI_LE_Write_RF_Path_Compensation command is used to indicate the
  *        RF path gain or loss between the RF transceiver and the antenna
  *        contributed by intermediate components. A positive value means a net
  *        RF path gain and a negative value means a net RF path loss. The RF Tx
  *        Path Compensation Value parameter shall be used by the Controller to
  *        calculate radiative Tx Power Level used in HCI commands, HCI events,
  *        Advertising physical channel PDUs, and Link Layer Control PDUs using
  *        the following equation: Radiative Tx Power Level = Tx Power Level at
  *        RF transceiver output + RF Tx Path Compensation Value. For example, if
  *        the Tx Power Level is +4 (dBm) at RF transceiver output and the RF
  *        Path Compensation Value is -1.5 (dB), the radiative Tx Power Level is
  *        +4+(-1.5) = 2.5 (dBm). The RF Rx Path Compensation Value parameter
  *        shall be used by the Controller to calculate the RSSI value reported
  *        to the Host.
  * @param rf_tx_path_compensation_value
  * @param rf_rx_path_compensation_value
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_write_rf_path_compensation(int16_t rf_tx_path_compensation_value,
                                               int16_t rf_rx_path_compensation_value);
/**
  * @brief The HCI_LE_Set_Privacy_Mode command is used to allow the Host to
  *        specify the privacy mode to be used for a given entry on the resolving
  *        list. The effect of this setting is specified in [Vol 6] Part B,
  *        Section 4.7. When an entry on the resolving list is removed, the mode
  *        associated with that entry shall also be removed. This command cannot
  *        be used when address translation is enabled in the Controller and:
  *        Advertising is enabled Scanning is enabled Create connection command
  *        is outstanding This command can be used at any time when address
  *        translation is disabled in the Controller. If the device is not on the
  *        resolving list, the Controller shall return the error code Unknown
  *        Connection Identifier (0x02).
  * @param peer_identity_address_type Peer Address type
  *        Values:
  *        - 0x00: Public Identity Address
  *        - 0x01: Random (static) Identity Address
  * @param peer_identity_address Public Identity Address or Random (static)
  *        Identity Address of the advertiser
  * @param privacy_mode 0x00 Use Network Privacy Mode for this peer device
  *        (default) 0x01 Use Device Privacy Mode for this peer device
  *        Values:
  *        - 0x00: Network Privacy Mode
  *        - 0x01: Device Privacy Mode
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_privacy_mode(uint8_t peer_identity_address_type,
                                     uint8_t peer_identity_address[6],
                                     uint8_t privacy_mode);
/**
  * @brief This command is used to start a test where the DUT receives test
  *        reference packets at a fixed interval. The tester generates the test
  *        reference packets. The rx_channel and PHY parameters specify the RF
  *        channel and PHY to be used by the receiver. If the Host sets the PHY
  *        parameter to a PHY that the Controller does not support, including a
  *        value that is reserved for future use, the Controller shall return the
  *        error code Unsupported Feature or Parameter Value (0x11). The
  *        modulation_index parameter specifies whether or not the Controller
  *        should assume the receiver has a stable modulation index. The
  *        expected_cte_length and expected_cte_type parameters specify the
  *        expected length and type of the Constant Tone Extensions in received
  *        test reference packets. When receiving on a PHY that allows Constant
  *        Tone Extensions, if the Constant Tone Extension in a received test
  *        reference packet does not match both of these, the DUT shall discard
  *        that packet. If expected_cte_length is not zero and PHY specifies a
  *        PHY that does not allow Constant Tone Extensions, the Controller shall
  *        return the error code Command Disallowed (0x0C). If the slot_durations
  *        parameter is set to 0x01 and the Controller does not support 1
  *        microsecond switching and sampling, the Controller shall return the
  *        error code Unsupported Feature or Parameter Value (0x11).
  *        slot_durations, switching_pattern_length, and antenna_ids[i] are only
  *        used when expecting an AoA Constant Tone Extension and shall be
  *        ignored when expecting an AoD Constant Tone Extension. If the
  *        Controller determines that any of the antenna_ids[i] values do not
  *        identify an antenna in the device's antenna array, it shall return the
  *        error code Unsupported Feature or Parameter Value (0x11). Note: Some
  *        Controllers may be unable to determine which values do or do not
  *        identify an antenna.
  * @param rx_channel
  *        Values:
  *        - 0x00 ... 0x27: N = (F - 2402) / 2.Frequency Range : 2402 MHz to 2480 MHz
  * @param phy PHY to be used by the receiver.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY
  * @param modulation_index
  *        Values:
  *        - 0x00: Assume transmitter will have a standard modulation index
  *        - 0x01: Assume transmitter will have a stable modulation index
  * @param expected_cte_length
  *        Values:
  *        - 0x00: No Constant Tone Extension expected (default)
  *        - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
  * @param expected_cte_type
  *        Values:
  *        - 0x00: Expect AoA Constant Tone Extension
  *        - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param switching_pattern_length
  *        Values:
  *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_receiver_test_v3(uint8_t rx_channel,
                                     uint8_t phy,
                                     uint8_t modulation_index,
                                     uint8_t expected_cte_length,
                                     uint8_t expected_cte_type,
                                     uint8_t slot_durations,
                                     uint8_t switching_pattern_length,
                                     uint8_t antenna_ids[]);
/**
  * @brief This command is used to start a test where the DUT generates test
  *        reference packets at a fixed interval. The Controller shall transmit
  *        at the power level indicated by the transmit_power_level parameter.
  *        The tx_channel and PHY parameters specify the RF channel and PHY to be
  *        used by the transmitter. If the Host sets the PHY parameter to a PHY
  *        that the Controller does not support, including a value that is
  *        reserved for future use, the Controller shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). The test_data_length
  *        and packet_payload parameters specify the length and contents of the
  *        Payload of the test reference packets. An LE Controller supporting the
  *        HCI_LE_Transmitter_Test command shall support packet_payload values
  *        0x00, 0x01 and 0x02. An LE Controller supporting the LE Coded PHY
  *        shall also support packet_payload value 0x04. An LE Controller may
  *        support other values of packet_payload. The cte_length and cte_type
  *        parameters specify the length and type of the Constant Tone Extension
  *        in the test reference packets. If the cte_type parameter is set to
  *        0x01 and the Controller does not support 1 microsecond switching, the
  *        Controller shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). If cte_length is not zero and PHY specifies a
  *        PHY that does not allow Constant Tone Extensions, the Controller shall
  *        return the error code Command Disallowed (0x0C). The
  *        switching_pattern_length and antenna_ids[i] parameters specify the
  *        antenna switching pattern. They are only used when transmitting an AoD
  *        Constant Tone Extension and shall be ignored when transmitting an AoA
  *        Constant Tone Extension. If the Controller determines that any of the
  *        antenna_ids[i] values do not identify an antenna in the device's
  *        antenna array, it shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). Note: Some Controllers may be unable to
  *        determine which values do or do not identify an antenna. The
  *        transmit_power_level parameter specifies the transmit power level to
  *        be used by the transmitter. If the parameter is set to a value other
  *        than 0x7E or 0x7F, then the Controller shall make the requested change
  *        or shall make the nearest change that it is capable of doing.
  * @param tx_channel N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
  *        Values:
  *        - 0x00 ... 0x27
  * @param test_data_length Length in bytes of payload data in each packet
  * @param packet_payload Content of the Payload of the test reference packets.
  *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
  *        Repeated '11110000' (in transmission order) sequence 2: Repeated
  *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
  *        Repeated '11111111' (in transmission order) sequence 5: Repeated
  *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
  *        transmission order) sequence 7: Repeated '01010101' (in transmission
  *        order) sequence
  *        Values:
  *        - 0x00: PRBS9
  *        - 0x01: Repeated '11110000'
  *        - 0x02: Repeated '10101010'
  *        - 0x03: PRBS15
  *        - 0x04: Repeated '11111111'
  *        - 0x05: Repeated '00000000'
  *        - 0x06: Repeated '00001111'
  *        - 0x07: Repeated '01010101'
  * @param phy PHY to be used by the transmitter.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param cte_length
  *        Values:
  *        - 0x00: No Constant Tone Extension expected (default)
  *        - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
  * @param cte_type
  *        Values:
  *        - 0x00: Expect AoA Constant Tone Extension
  *        - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
  * @param switching_pattern_length The number of Antenna IDs in the pattern.
  *        Values:
  *        - 0x02 ... 0x4B
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_transmitter_test_v3(uint8_t tx_channel,
                                        uint8_t test_data_length,
                                        uint8_t packet_payload,
                                        uint8_t phy,
                                        uint8_t cte_length,
                                        uint8_t cte_type,
                                        uint8_t switching_pattern_length,
                                        uint8_t antenna_ids[]);
/**
  * @brief The HCI_LE_Set_Connectionless_CTE_Transmit_Parameters command is used
  *        to set the type, length, and antenna switching pattern for the
  *        transmission of Constant Tone Extensions in any periodic advertising
  *        on the advertising set identified by the advertising_handle parameter.
  *        The cte_count parameter specifies how many packets with a Constant
  *        Tone Extension are to be transmitted in each periodic advertising
  *        event. If the number of packets that would otherwise be transmitted is
  *        less than this, the Controller shall transmit sufficient AUX_CHAIN_IND
  *        PDUs with no AdvData to make up the number. However, if a change in
  *        circumstances since this command was issued means that the Controller
  *        can no longer schedule all of these packets, it should transmit as
  *        many as possible. If the Host issues this command when Constant Tone
  *        Extensions have been enabled in the advertising set, the Controller
  *        shall return the error code Command Disallowed (0x0C). The
  *        switching_pattern_length and antenna_ids[i] parameters are only used
  *        when transmitting an AoD Constant Tone Extension and shall be ignored
  *        if cte_type specifies an AoA Constant Tone Extension. If the
  *        cte_length parameter is greater than the maximum length of Constant
  *        Tone Extension supported, the Controller shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). If the Host requests a
  *        type of Constant Tone Extension that the Controller does not support,
  *        the Controller shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). If the Controller is unable to schedule
  *        cte_count packets in each event, the Controller shall return the error
  *        code Unsupported Feature or Parameter Value (0x11). If the advertising
  *        set corresponding to the advertising_handle parameter does not exist,
  *        the Controller shall return the error code Unknown Advertising
  *        Identifier (0x42). If switching_pattern_length is greater than the
  *        maximum length of switching pattern supported by the Controller (see
  *        Section 7.8.87), the Controller shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). If the Controller
  *        determines that any of the antenna_ids[i] values do not identify an
  *        antenna in the device's antenna array, it shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). Note: Some Controllers
  *        may be unable to determine which values do or do not identify an
  *        antenna.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @param cte_length
  *        Values:
  *        - 0x02 ... 0x14: Constant Tone Extension length in 8 microseconds units
  * @param cte_type
  *        Values:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  * @param cte_count The cte_count parameter specifies how many packets with a
  *        Constant Tone Extension are to be transmitted in each periodic
  *        advertising event. If the number of packets that would otherwise be
  *        transmitted is less than this, the Controller shall transmit
  *        sufficient AUX_CHAIN_IND PDUs with no AdvData to make up the number.
  *        However, if a change in circumstances since this command was issued
  *        means that the Controller can no longer schedule all of these packets,
  *        it should transmit as many as possible.
  *        Values:
  *        - 0x01 ... 0x10: The number of Constant Tone Extensions to transmit in each periodic advertising interval
  * @param switching_pattern_length
  *        Values:
  *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_connectionless_cte_transmit_parameters(uint8_t advertising_handle,
                                                               uint8_t cte_length,
                                                               uint8_t cte_type,
                                                               uint8_t cte_count,
                                                               uint8_t switching_pattern_length,
                                                               uint8_t antenna_ids[]);
/**
  * @brief The HCI_LE_Set_Connectionless_CTE_Transmit_Enable command is used to
  *        request that the Controller enables or disables the use of Constant
  *        Tone Extensions in any periodic advertising on the advertising set
  *        identified by advertising_handle. In order to start sending periodic
  *        advertisements containing a Constant Tone Extension, the Host must
  *        also enable periodic advertising using the
  *        HCI_LE_Set_Periodic_Advertising_Enable command (see Section 7.8.63).
  *        Note: Periodic advertising can only be enabled when advertising is
