zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        enabled on the same advertising set, but can continue after
  *        advertising has been disabled. If the Host issues this command before
  *        it has issued the HCI_LE_Set_Periodic_Advertising_Parameters command
  *        (see Section 7.8.61) for the advertising set, the Controller shall
  *        return the error code Command Disallowed (0x0C). Once enabled, the
  *        Controller shall continue advertising with Constant Tone Extensions
  *        until either one of the following occurs: - The Host issues an
  *        HCI_LE_Set_Connectionless_CTE_Transmit_Enable command with cte_enable
  *        set to 0x00 (disabling Constant Tone Extensions but allowing periodic
  *        advertising to continue). - The Host issues an
  *        HCI_LE_Set_Periodic_Advertising_Enable command (see Section 7.8.63)
  *        with Enable set to 0x00 (disabling periodic advertising). If periodic
  *        advertising is re-enabled then it shall continue to contain Constant
  *        Tone Extensions. If the Host issues this command before it has issued
  *        the HCI_LE_Set_Connectionless_CTE_Transmit_Parameters command for the
  *        advertising set, the Controller shall return the error code Command
  *        Disallowed (0x0C). If the periodic advertising is on a PHY that does
  *        not allow Constant Tone Extensions, the Controller shall return the
  *        error code Command Disallowed (0x0C).
  * @param advertising_handle Identifier for the advertising set in which
  *        Constant Tone Extension is being enabled or disabled
  *        Values:
  *        - 0x00 ... 0xEF
  * @param cte_enable It enables or disables the use of Constant Tone Extensions.
  *        Values:
  *        - 0x00: Advertising with Constant Tone Extension is disabled (default)
  *        - 0x01: Advertising with Constant Tone Extension is enabled
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_connectionless_cte_transmit_enable(uint8_t advertising_handle,
                                                           uint8_t cte_enable);
/**
  * @brief The HCI_LE_Set_Connectionless_IQ_Sampling_Enable command is used to
  *        request that the Controller enables or disables capturing IQ samples
  *        from the Constant Tone Extension of periodic advertising packets in
  *        the periodic advertising train identified by the sync_handle
  *        parameter. If that periodic advertising train does not exist, then the
  *        Controller shall return the error code Unknown Advertising Identifier
  *        (0x42). The max_sampled_cte_s parameter specifies the maximum number of
  *        Constant Tone Extensions in each periodic advertising event that the
  *        Controller should collect and report IQ samples from. The Controller
  *        should sample all Constant Tone Extensions up to this number. If the
  *        sampling_enable parameter is set to 0x01 (sampling is enabled), the
  *        Controller starts attempting to capture IQ samples from the periodic
  *        advertisements. Once sampling has been enabled, the Controller shall
  *        continue taking IQ samples until the Host issues an
  *        HCI_LE_Set_Connectionless_IQ_Enable command with sampling_enable set
  *        to 0x00 (sampling is disabled) or synchronization with the periodic
  *        advertising train is lost. If sampling_enable is set to 0x00,
  *        slot_durations, max_sampled_cte_s, switching_pattern_length, and
  *        antenna_ids shall be ignored. The command is also used to set the
  *        antenna switching pattern and switching and sampling slot durations to
  *        be used while receiving the Constant Tone Extension. If slot_durations
  *        is set to 0x01 and the Controller does not support 1 microsecond
  *        switching and sampling, the Controller shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). The slot_durations,
  *        switching_pattern_length, and antenna_ids parameters are only used
  *        when receiving an AoA Constant Tone Extension and do not affect the
  *        reception of an AoD Constant Tone Extension. If
  *        switching_pattern_length is greater than the maximum length of
  *        switching pattern supported by the Controller, the Controller shall
  *        return the error code Unsupported Feature or Parameter Value (0x11).
  *        If the Controller determines that any of the antenna_ids[i] values do
  *        not identify an antenna in the device's antenna array, it shall return
  *        the error code Unsupported Feature or Parameter Value (0x11). Note:
  *        Some Controllers may be unable to determine which values do or do not
  *        identify an antenna. If sampling_enable is set to 0x01 and the
  *        periodic advertising is on a PHY that does not allow Constant Tone
  *        Extensions, the Controller shall return the error code Command
  *        Disallowed (0x0C).
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param sampling_enable If the sampling_enable parameter is set to 0x01
  *        (sampling is enabled), the Controller starts attempting to capture IQ
  *        samples from the periodic advertisements.
  *        Values:
  *        - 0x00: DISABLE
  *        - 0x01: ENABLE
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param max_sampled_cte_s It specifies the maximum number of Constant Tone
  *        Extensions in each periodic advertising event that the Controller
  *        should collect and report IQ samples from. The Controller should
  *        sample all Constant Tone Extensions up to this number.
  *        Values:
  *        - 0x00: REPORT_ALL_CTES
  *        - 0x01 ... 0x10
  * @param switching_pattern_length The number of Antenna IDs in the pattern.
  *        Values:
  *        - 0x02 ... 0x4B
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_connectionless_iq_sampling_enable(uint16_t sync_handle,
                                                          uint8_t sampling_enable,
                                                          uint8_t slot_durations,
                                                          uint8_t max_sampled_cte_s,
                                                          uint8_t switching_pattern_length,
                                                          uint8_t antenna_ids[]);
/**
  * @brief The HCI_LE_Set_Connection_CTE_Receive_Parameters command is used to
  *        enable or disable sampling received Constant Tone Extension fields on
  *        the connection identified by the connection_handle parameter and to
  *        set the antenna switching pattern and switching and sampling slot
  *        durations to be used. If the sampling_enable parameter is set to 0x01,
  *        the Controller shall sample Constant Tone Extensions on the specified
  *        connection and report the samples to the Host. If it is set to 0x00,
  *        the Controller shall cease sampling on the specified connection; the
  *        remaining parameters shall be ignored. If slot_durations is set to
  *        0x01 and the Controller does not support 1 microsecond switching and
  *        sampling, the Controller shall return the error code Unsupported
  *        Feature or Parameter Value (0x11). The slot_durations,
  *        switching_pattern_length, and antenna_ids parameters are only used
  *        when receiving an AoA Constant Tone Extension and do not affect the
  *        reception of an AoD Constant Tone Extension. If
  *        switching_pattern_length is greater than the maximum length of
  *        switching pattern supported by the Controller, the Controller shall
  *        return the error code Unsupported Feature or Parameter Value (0x11).
  *        If the Controller determines that any of the antenna_ids[i] values do
  *        not identify an antenna in the device's antenna array, it shall return
  *        the error code Unsupported Feature or Parameter Value (0x11). Note:
  *        Some Controllers may be unable to determine which values do or do not
  *        identify an antenna.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param sampling_enable
  *        Values:
  *        - 0x00: Connection IQ sampling is disabled (default)
  *        - 0x01: Connection IQ sampling is enabled
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param switching_pattern_length
  *        Values:
  *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_connection_cte_receive_parameters(uint16_t connection_handle,
                                                          uint8_t sampling_enable,
                                                          uint8_t slot_durations,
                                                          uint8_t switching_pattern_length,
                                                          uint8_t antenna_ids[]);
/**
  * @brief The HCI_LE_Set_Connection_CTE_Transmit_Parameters command is used to
  *        set the antenna switching pattern and permitted Constant Tone
  *        Extension types used for transmitting Constant Tone Extensions
  *        requested by the peer device on the connection identified by the
  *        connection_handle parameter. If the Host issues this command when
  *        Constant Tone Extension responses have been enabled on the connection,
  *        the Controller shall return the error code Command Disallowed (0x0C).
  *        If the CTE_Types parameter has a bit set for a type of Constant Tone
  *        Extension that the Controller does not support, the Controller shall
  *        return the error code Unsupported Feature or Parameter Value (0x11).
  *        The switching_pattern_length and antenna_ids[i] parameters are only
  *        used when transmitting an AoD Constant Tone Extension and shall be
  *        ignored when CTE_Types does not have a bit set for an AoD Constant
  *        Tone Extension; they do not affect the transmission of an AoA Constant
  *        Tone Extension. If switching_pattern_length is greater than the
  *        maximum length of switching pattern supported by the Controller, the
  *        Controller shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). If the Controller determines that any of the
  *        antenna_ids[i] values do not identify an antenna in the device's
  *        antenna array, it shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). Note: Some Controllers may be unable to
  *        determine which values do or do not identify an antenna.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param cte_type
  *        Flags:
  *        - 0x01: Allow AoA Constant Tone Extension Response
  *        - 0x02: Allow AoD Constant Tone Extension Response with 1 microsecond slots
  *        - 0x04: Allow AoD Constant Tone Extension Response with 2 microseconds slots
  * @param switching_pattern_length
  *        Values:
  *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
  * @param antenna_ids List of Antenna IDs in the pattern
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_connection_cte_transmit_parameters(uint16_t connection_handle,
                                                           uint8_t cte_type,
                                                           uint8_t switching_pattern_length,
                                                           uint8_t antenna_ids[]);
/**
  * @brief The HCI_LE_Connection_CTE_Request_Enable command is used to request
  *        the Controller to start or stop initiating the Constant Tone Extension
  *        Request procedure (see [Vol 6] Part B, Section 5.1.12) on a connection
  *        identified by the connection_handle parameter. If the Host issues this
  *        command when the Controller is aware (e.g. through a previous feature
  *        exchange) that the peer device's Link Layer does not support the
  *        Connection CTE Response feature, the Controller shall return the error
  *        code Unsupported Remote Feature / Unsupported LMP Feature (0x1A). If
  *        the Host issues this command when the Controller is aware that the
  *        peer device's Link Layer does not support the requested CTE type, the
  *        Controller should return the error code Unsupported Remote Feature /
  *        Unsupported LMP Feature (0x1A). If Enable is set to 0x00, the
  *        remaining parameters shall be ignored. The cte_request_interval
  *        parameter defines whether the Constant Tone Extension Request
  *        procedure is initiated only once or periodically. In the case of
  *        periodic operation, the procedure is initiated every
  *        cte_request_interval. However, the Controller may delay initiating the
  *        procedure beyond the requested interval (e.g., in order to prioritize
  *        other activities). The requested_cte_length parameter indicates the
  *        minimum length of the Constant Tone Extension and the
  *        requested_cte_type parameter indicates the type of Constant Tone
  *        Extension that the Controller shall request from the remote device. A
  *        request is active on a connection from when the Host issues a
  *        successful command with Enable set to 0x01 until the single procedure
  *        has been performed, the period specified by cte_request_interval has
  *        ended, or a command with Enable set to 0x00 has succeeded, whichever
  *        happens first. If the Host issues this command with Enable set to 0x01
  *        while a request is active for the specified connection, the Controller
  *        shall return the error code Command Disallowed (0x0C). Note: The
  *        failed command will not affect the behavior of the Link Layer in
  *        respect of the currently-active request. If the Host issues this
  *        command before issuing the
  *        HCI_LE_Set_Connection_CTE_Receive_Parameters command at least once on
  *        the connection, the Controller shall return the error code Command
  *        Disallowed (0x0C). If the Host issues this command when the receiver
  *        PHY for the connection is not a PHY that allows Constant Tone
  *        Extensions, the Controller shall return the error code Command
  *        Disallowed (0x0C). If the Host sets cte_request_interval to a non-zero
  *        value less than or equal to connSlaveLatency, the Controller shall
  *        return the error code Command Disallowed (0x0C). If Enable is set to
  *        0x01 and the receiver PHY for the connection changes to a PHY that
  *        does not allow Constant Tone Extensions, then the Controller shall
  *        automatically disable Constant Tone Extension requests as if the Host
  *        had issued this command with Enable set to 0x00. Note: If the PHY
  *        changes back to a PHY that allows Constant Tone Extensions, then the
  *        Controller will not automatically re-enable Constant Tone Extension
  *        requests.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param enable If it is set to 0x00, the remaining parameters shall be
  *        ignored.
  *        Values:
  *        - 0x00: Disable Constant Tone Extension Request for the connection (default)
  *        - 0x01: Enable Constant Tone Extension Request for the connection
  * @param cte_request_interval It defines whether the Constant Tone Extension
  *        Request procedure is initiated only once or periodically. In the case
  *        of periodic operation, the procedure is initiated every
  *        cte_request_interval. However, the Controller may delay initiating the
  *        procedure beyond the requested interval (e.g., in order to prioritize
  *        other activities).
  *        Values:
  *        - 0x0000: Initiate the Constant Tone Extension Request procedure once,
  *                  at the nearliest practical opportunity.
  *        - 0x0001 ... 0xFFFF: Requested interval for initiating the Constant Tone
  *                             Extension Request procedure in number of connection events.
  * @param requested_cte_length It indicates the minimum length of the Constant
  *        Tone Extension and the requested_cte_type parameter indicates the type
  *        of Constant Tone Extension that the Controller shall request from the
  *        remote device.
  *        Values:
  *        - 0x02 ... 0x14: Minimum length of the Constant Tone Extension being requested in 8 nmicroseconds units
  * @param requested_cte_type
  *        Flags:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_connection_cte_request_enable(uint16_t connection_handle,
                                                  uint8_t enable,
                                                  uint16_t cte_request_interval,
                                                  uint8_t requested_cte_length,
                                                  uint8_t requested_cte_type);
/**
  * @brief The HCI_LE_Connection_CTE_Response_Enable command is used to request
  *        the Controller to respond to LL_CTE_REQ PDUs with LL_CTE_RSP PDUs on
  *        the specified connection. If the Host issues this command before
  *        issuing the HCI_LE_Set_Connection_CTE_Transmit_Parameters command at
  *        least once on the connection, the Controller shall return the error
  *        code Command Disallowed (0x0C). If the Host issues this command when
  *        the transmitter PHY for the connection is not a PHY that allows
  *        Constant Tone Extensions, the Controller shall return the error code
  *        Command Disallowed (0x0C). If the transmitter PHY for the connection
  *        changes to a PHY that does not allow Constant Tone Extensions, then
  *        the Controller shall automatically disable Constant Tone Extension
  *        responses.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param enable
  *        Values:
  *        - 0x00: Disable Constant Tone Extension Response for the connection (default)
  *        - 0x01: Enable Constant Tone Extension Response for the connection
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_connection_cte_response_enable(uint16_t connection_handle,
                                                   uint8_t enable);
/**
  * @brief The HCI_LE_Read_Antenna_Information command allows the Host to read
  *        the switching rates, the sampling rates, the number of antennae, and
  *        the maximum length of a transmitted Constant Tone Extension supported
  *        by the Controller.
  * @param[out] supported_switching_sampling_rates
  *             Flags:
  *             - 0x00: 1 microsecond switching supported for AoD transmission
  *             - 0x02: 1 microsecond switching supported for AoD reception
  *             - 0x04: 1 microsecond switching and sampling supported for AoA reception
  * @param[out] num_antennae
  *             Values:
  *             - 0x01 ... 0x4B: The number of antennae supported by the Controller
  * @param[out] max_switching_pattern_length
  *             Values:
  *             - 0x02 ... 0x4B: Maximum length of antenna switching pattern supported by the Controller
  * @param[out] max_cte_length
  *             Values:
  *             - 0x02 ... 0x14: Maximum length of a transmitted Constant Tone Extension supported
  *                              in 8 microseconds units
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_antenna_information(uint8_t *supported_switching_sampling_rates,
                                             uint8_t *num_antennae,
                                             uint8_t *max_switching_pattern_length,
                                             uint8_t *max_cte_length);
/**
  * @brief The HCI_LE_Set_Periodic_Advertising_Receive_Enable command will enable
  *        or disable reports for the periodic advertising train identified by
  *        the sync_handle parameter. The Enable parameter determines whether
  *        reporting is enabled or disabled. If the value is the same as the
  *        current state, the command has no effect. If the periodic advertising
  *        train corresponding to the sync_handle parameter does not exist, the
  *        Controller shall return the error code Unknown Advertising Identifier
  *        (0x42).
  * @param sync_handle sync_handle identifying the periodic advertising train
  *        Values:
  *        - 0x0000 ... 0x0EFF: sync_handle identifying the periodic advertising train
  * @param enable It determines whether reporting is enabled or disabled
  *        Values:
  *        - 0x00: Reporting disabled
  *        - 0x01: Reporting enabled
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_periodic_advertising_receive_enable(uint16_t sync_handle,
                                                            uint8_t enable);
/**
  * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising train identified by the sync_handle parameter to
  *        a connected device. The service_data parameter is a value provided by
  *        the Host for use by the Host of the peer device. It is not used by the
  *        Controller. The connected device is identified by the
  *        connection_handle parameter. If the periodic advertising train
  *        corresponding to the sync_handle parameter does not exist, the
  *        Controller shall return the error code Unknown Advertising Identifier
  *        (0x42). If the connection_handle parameter does not identify a current
  *        connection, the Controller shall return the error code Unknown
  *        Connection Identifier (0x02). If the remote device has not indicated
  *        support for the Periodic Advertising Sync Transfer - Recipient
  *        feature, the Controller shall return the error code Unsupported Remote
  *        Feature / Unsupported LMP Feature (0x1A). Note: This command may
  *        complete before the periodic advertising synchronization information
  *        is sent. No indication is given as to how the recipient handled the
  *        information.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data The service_data parameter is a value provided by the
  *        Host for use by the Host of the peer device. It is not used by the
  *        Controller.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
