zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/includes/stm32wb07_06_hci_le.h
  *        - 0x0000 ... 0x0EFF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_periodic_advertising_sync_transfer(uint16_t connection_handle,
                                                       uint16_t service_data,
                                                       uint16_t sync_handle);
/**
  * @brief The HCI_LE_Periodic_Advertising_Set_Info_Transfer command is used to
  *        instruct the Controller to send synchronization information about the
  *        periodic advertising in an advertising set to a connected device. The
  *        advertising_handle parameter identifies the advertising set. If the
  *        parameters in the advertising set have changed since the periodic
  *        advertising was first enabled, the current parameters - not the
  *        original ones - are sent. The service_data parameter is a value
  *        provided by the Host to identify the periodic advertising train to the
  *        peer device. It is not used by the Controller. The connected device is
  *        identified by the connection_handle parameter. If the advertising set
  *        corresponding to the advertising_handle parameter does not exist, the
  *        Controller shall return the error code Unknown Advertising Identifier
  *        (0x42). If periodic advertising is not currently in progress for the
  *        advertising set, the Controller shall return the error code Command
  *        Disallowed (0x0C). If the connection_handle parameter does not
  *        identify a current connection, the Controller shall return the error
  *        code Unknown Connection Identifier (0x02). If the remote device has
  *        not indicated support for the Periodic Advertising Sync Transfer -
  *        Recipient feature, the Controller shall return the error code
  *        Unsupported Remote Feature / Unsupported LMP Feature (0x1A). Note:
  *        This command may complete before the periodic advertising
  *        synchronization information is sent. No indication is given as to how
  *        the recipient handled the information.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data It is a value provided by the Host to identify the
  *        periodic advertising train to the peer device. It is not used by the
  *        Controller.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_periodic_advertising_set_info_transfer(uint16_t connection_handle,
                                                           uint16_t service_data,
                                                           uint8_t advertising_handle);
/**
  * @brief The HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command
  *        is used to specify how the Controller will process periodic
  *        advertising synchronization information received from the device
  *        identified by the connection_handle parameter (the "transfer mode").
  *        The Mode parameter specifies the action to be taken when periodic
  *        advertising synchronization information is received. If Mode is 0x00,
  *        the Controller will ignore the information. Otherwise it will notify
  *        the Host and synchronize to the periodic advertising. Mode also
  *        specifies whether periodic advertising reports are initially enabled
  *        or disabled. The Skip parameter specifies the number of consecutive
  *        periodic advertising packets that the receiver may skip after
  *        successfully receiving a periodic advertising packet. The sync_timeout
  *        parameter specifies the maximum permitted time between successful
  *        receives. If this time is exceeded, synchronization is lost.
  *        Irrespective of the value of the Skip parameter, the Controller should
  *        stop skipping packets before the sync_timeout would be exceeded. The
  *        cte_type parameter specifies whether to only synchronize to periodic
  *        advertising with certain types of Constant Tone Extension. If the
  *        periodic advertiser changes the type of the Constant Tone Extension
  *        after the Controller has synchronized with the periodic advertising,
  *        it shall remain synchronized. Note: A value of 0 (i.e. all bits clear)
  *        indicates that the presence or absence of a Constant Tone Extension is
  *        irrelevant. This command does not affect any processing of any
  *        periodic advertising synchronization information already received from
  *        the peer device, whether or not the Controller has yet synchronized to
  *        the periodic advertising train it describes. The parameter values
  *        provided by this command override those provided via the
  *        HCI_LE_Set_Default_Periodic_Advertising_Sync_Transfer_Parameters
  *        command (Section 7.8.92) or any preferences previously set using the
  *        HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command on
  *        the same connection. If the connection_handle parameter does not
  *        identify a current connection, the Controller shall return the error
  *        code Unknown Connection Identifier (0x02).
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param mode The Mode parameter specifies the action to be taken when periodic
  *        advertising synchronization information is received. If Mode is 0x00,
  *        the Controller will ignore the information. Otherwise it will notify
  *        the Host and synchronize to the periodic advertising. Mode also
  *        specifies whether periodic advertising reports are initially enabled
  *        or disabled.
  *        Values:
  *        - 0x00: No attempt is made to synchronize to the periodic advertising and no
  *                HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *        - 0x01: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be disabled.
  *        - 0x02: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be enabled.
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3: The number of periodic advertising packets that can be skipped after
  *                             a successful receive
  * @param sync_timeout Synchronization timeout for the periodic advertising
  *        train. Time = N*10 ms.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms)
  * @param cte_type It specifies whether to only synchronize to periodic
  *        advertising with certain types of Constant Tone Extension. If the
  *        periodic advertiser changes the type of the Constant Tone Extension
  *        after the Controller has synchronized with the periodic advertising,
  *        it shall remain synchronized.
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds slots
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_periodic_advertising_sync_transfer_parameters(uint16_t connection_handle,
                                                                      uint8_t mode,
                                                                      uint16_t skip,
                                                                      uint16_t sync_timeout,
                                                                      uint8_t cte_type);
/**
  * @brief The HCI_LE_Set_Default_Periodic_Advertising_Sync_Transfer_Parameters
  *        command is used to specify the initial value for the mode, skip,
  *        timeout, and Constant Tone Extension type (set by the
  *        HCI_LE_Set_Periodic_Advertising_Sync_Transfer_Parameters command; see
  *        Section 7.8.91) to be used for all subsequent connections over the LE
  *        transport. The Mode parameter specifies the initial action to be
  *        taken. If Mode is 0x00, the Controller will ignore the information.
  *        Otherwise it will notify the Host and synchronize to the periodic
  *        advertising. Mode also specifies whether periodic advertising reports
  *        are initially enabled or disabled. The Skip parameter specifies the
  *        number of consecutive periodic advertising packets that the receiver
  *        may skip after successfully receiving a periodic advertising packet.
  *        The sync_timeout parameter specifies the maximum permitted time
  *        between successful receives. If this time is exceeded, synchronization
  *        is lost. The cte_type parameter specifies whether to only synchronize
  *        to periodic advertising with certain types of Constant Tone Extension.
  *        If the periodic advertiser changes the type of the Constant Tone
  *        Extension after the Controller has synchronized with the periodic
  *        advertising, it shall remain synchronized. Note: A value of 0 (i.e.
  *        all bits clear) indicates that the presence or absence of a Constant
  *        Tone Extension is irrelevant. This command does not affect any
  *        existing connection.
  * @param mode The Mode parameter specifies the initial action to be taken. If
  *        Mode is 0x00, the Controller will ignore the information. Otherwise it
  *        will notify the Host and synchronize to the periodic advertising. Mode
  *        also specifies whether periodic advertising reports are initially
  *        enabled or disabled.
  *        Values:
  *        - 0x00: No attempt is made to synchronize to the periodic advertising and no
  *                HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *        - 0x01: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
  *                HCI_LE_Periodic_Advertising_Report events will be disabled.
  *        - 0x02: An HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is sent to the Host.
                   HCI_LE_Periodic_Advertising_Report events will be enabled.
  * @param skip The Skip parameter specifies the number of consecutive periodic
  *        advertising packets that the receiver may skip after successfully
  *        receiving a periodic advertising packet.
  *        Values:
  *        - 0x0000 ... 0x01F3: The number of periodic advertising packets that can be skipped after
  *                             a successful receive
  * @param sync_timeout Synchronization timeout for the periodic advertising
  *        train. Time = N*10 ms.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x4000 (163840 ms)
  * @param cte_type The cte_type parameter specifies whether to only synchronize
  *        to periodic advertising with certain types of Constant Tone Extension.
  *        If the periodic advertiser changes the type of the Constant Tone
  *        Extension after the Controller has synchronized with the periodic
  *        advertising, it shall remain synchronized.
  *        Flags:
  *        - 0x01: Do not sync to packets with an AoA Constant Tone Extension
  *        - 0x02: Do not sync to packets with an AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x04: Do not sync to packets with an AoD Constant Tone Extension with 2 microseconds slots
  *        - 0x10: Do not sync to packets without a Constant Tone Extension
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_default_periodic_advertising_sync_transfer_parameters(uint8_t mode,
                                                                              uint16_t skip,
                                                                              uint16_t sync_timeout,
                                                                              uint8_t cte_type);
/**
  * @brief Read the current and maximum transmit power levels of the local
  *        Controller on the ACL connection identified by the connection_handle
  *        parameter and the PHY indicated by the PHY parameter.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param phy PHY associated with the connection  (not necessarily the currently
  *        used one).
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param[out] current_transmit_power_level Current TX power level (dBm).
  *             Values:
  *             - -127 ... 20
  *             - 127: NA
  * @param[out] max_transmit_power_level Maximum TX power level (dBm).
  *             Values:
  *             - -127 ... 20
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_enhanced_read_transmit_power_level(uint16_t connection_handle,
                                                       uint8_t phy,
                                                       int8_t *current_transmit_power_level,
                                                       int8_t *max_transmit_power_level);
/**
  * @brief Read the transmit power level used by the remote Controller on the ACL
  *        connection that is identified by the connection_handle parameter and
  *        the PHY indicated by the PHY parameter. Initiate a Power Control
  *        Request procedure to obtain the remote transmit power level if no
  *        prior value is available or used.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param phy PHY associated with the connection  (not necessarily the currently
  *        used one).
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_read_remote_transmit_power_level(uint16_t connection_handle,
                                                     uint8_t phy);
/**
  * @brief Set the path loss threshold reporting parameters for the ACL
  *        connection identified by the connection_handle parameter.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param high_threshold High threshold for the path loss. Units: dB.
  *        Values:
  *        - 0 ... 254
  *        - 255: UNUSED
  * @param high_hysteresis Hysteresis value for the high threshold. Units: dB.
  * @param low_threshold Low threshold for the path loss. Units: dB.
  * @param low_hysteresis Hysteresis value for the low threshold. Units: dB.
  * @param min_time_spent Minimum time in number of connection events to be
  *        observed once the path crosses the threshold before an event is
  *        generated.
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_path_loss_reporting_parameters(uint16_t connection_handle,
                                                       uint8_t high_threshold,
                                                       uint8_t high_hysteresis,
                                                       uint8_t low_threshold,
                                                       uint8_t low_hysteresis,
                                                       uint16_t min_time_spent);
/**
  * @brief Enable or disable path loss reporting for the ACL connection
  *        identified by the connection_handle parameter. Initiate a new Power
  *        Control Request procedure to obtain the remote transmit power level if
  *        no prior value is available or used and no prior Power Control Request
  *        procedure has been initiated. Path loss reporting is disabled when the
  *        connection is first created.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param enable Enable (1) or disable (0) reportinig.
  *        Values:
  *        - 0x00: DISABLE
  *        - 0x01: ENABLE
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_path_loss_reporting_enable(uint16_t connection_handle,
                                                   uint8_t enable);
/**
  * @brief Enable or disable the reporting of transmit power level changes in the
  *        local and remote Controllers for the ACL connection identified by the
  *        connection_handle parameter. Initiate a new Power Control Request
  *        procedure to obtain the remote transmit power level if remote_enable
  *        is 0x01, and no prior value is available or used, and no prior Power
  *        Control Request procedure has been initiated.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param local_enable Enable (1) or disable (0) local transmit power reports.
  *        Values:
  *        - 0x00: DISABLE
  *        - 0x01: ENABLE
  * @param remote_enable Enable (1) or disable (0) remote transmit power reports.
  *        Values:
  *        - 0x00: DISABLE
  *        - 0x01: ENABLE
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_set_transmit_power_reporting_enable(uint16_t connection_handle,
                                                        uint8_t local_enable,
                                                        uint8_t remote_enable);
/**
  * @brief This command is used to start a test where the DUT generates test
  *        reference packets at a fixed interval. The Controller shall transmit
  *        at the power level indicated by the transmit_power_level parameter.
  *        The tx_channel and PHY parameters specify the RF channel and PHY to be
  *        used by the transmitter. If the Host sets the PHY parameter to a PHY
  *        that the Controller does not support, including a value that is
  *        reserved for future use, the Controller shall return the error code
  *        Unsupported Feature or Parameter Value (0x11). The test_data_length
  *        and packet_payload parameters specify the length and contents of the
  *        Payload of the test reference packets. An LE Controller supporting the
  *        HCI_LE_Transmitter_Test command shall support packet_payload values
  *        0x00, 0x01 and 0x02. An LE Controller supporting the LE Coded PHY
  *        shall also support packet_payload value 0x04. An LE Controller may
  *        support other values of packet_payload. The cte_length and cte_type
  *        parameters specify the length and type of the Constant Tone Extension
  *        in the test reference packets. If the cte_type parameter is set to
  *        0x01 and the Controller does not support 1 microsecond switching, the
  *        Controller shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). If cte_length is not zero and PHY specifies a
  *        PHY that does not allow Constant Tone Extensions, the Controller shall
  *        return the error code Command Disallowed (0x0C). The
  *        switching_pattern_length and antenna_ids[i] parameters specify the
  *        antenna switching pattern. They are only used when transmitting an AoD
  *        Constant Tone Extension and shall be ignored when transmitting an AoA
  *        Constant Tone Extension. If the Controller determines that any of the
  *        antenna_ids[i] values do not identify an antenna in the device's
  *        antenna array, it shall return the error code Unsupported Feature or
  *        Parameter Value (0x11). Note: Some Controllers may be unable to
  *        determine which values do or do not identify an antenna. The
  *        transmit_power_level parameter specifies the transmit power level to
  *        be used by the transmitter. If the parameter is set to a value other
  *        than 0x7E or 0x7F, then the Controller shall make the requested change
  *        or shall make the nearest change that it is capable of doing.
  * @param tx_channel N = (F - 2402) / 2. Frequency Range : 2402 MHz to 2480 MHz
  *        Values:
  *        - 0x00 ... 0x27
  * @param test_data_length Length in bytes of payload data in each packet
  * @param packet_payload Content of the Payload of the test reference packets.
  *        0: PRBS9 sequence '11111111100000111101...' (in transmission order) 1:
  *        Repeated '11110000' (in transmission order) sequence 2: Repeated
  *        '10101010' (in transmission order) sequence 3: PRBS15 sequence 4:
  *        Repeated '11111111' (in transmission order) sequence 5: Repeated
  *        '00000000' (in transmission order) sequence 6: Repeated '00001111' (in
  *        transmission order) sequence 7: Repeated '01010101' (in transmission
  *        order) sequence
  *        Values:
  *        - 0x00: PRBS9
  *        - 0x01: Repeated '11110000'
  *        - 0x02: Repeated '10101010'
  *        - 0x03: PRBS15
  *        - 0x04: Repeated '11111111'
  *        - 0x05: Repeated '00000000'
  *        - 0x06: Repeated '00001111'
  *        - 0x07: Repeated '01010101'
  * @param phy PHY to be used by the transmitter.
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param cte_length
  *        Values:
  *        - 0x00: No Constant Tone Extension expected (default)
  *        - 0x02 ... 0x14: Expected length of the Constant Tone Extension in 8 microseconds units.
  * @param cte_type
  *        Values:
  *        - 0x00: Expect AoA Constant Tone Extension
  *        - 0x01: Expect AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: Expect AoD Constant Tone Extension with 2 microseconds slots
  * @param switching_pattern_length
  *        Values:
  *        - 0x02 ... 0x4B: The number of Antenna IDs in the pattern.
  * @param antenna_ids List of Antenna IDs in the pattern
  * @param transmit_power_level
  *        Values:
  *        - -127 ... 20: Set transmitter to the specified or the nearest transmit power level.
  *        - 126: Set transmitter to minimum transmit power level
  *        - 127: Set transmitter to maximum transmit power level
  * @retval Value indicating success or error code.
  */
ble_status_t hci_le_transmitter_test_v4(uint8_t tx_channel,
                                        uint8_t test_data_length,
                                        uint8_t packet_payload,
                                        uint8_t phy,
                                        uint8_t cte_length,
                                        uint8_t cte_type,
                                        uint8_t switching_pattern_length,
                                        uint8_t antenna_ids[],
                                        int8_t transmit_power_level);
/**
     * @}
     */

#ifdef __cplusplus
}
#endif

#endif /* _STM32WB07_06_HCI_LE_H_ */
